
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ds_СлужебныеСообщения.ЭтаПодпискаДляСотрудникаИнтернетМагазина() Тогда
		Возврат;
	КонецЕсли;
	
	КлючСлужебногоОбсуждения = ds_СлужебныеСообщения.ПолучитьКлючСлужебногоОбсужденияСотрудникаИнтернетМагазина();
	ОбработкаСообщенийСервера = Новый ОписаниеОповещения("ОбработкаСообщенийСервера", ds_СлужебныеСообщенияКлиент);
	СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, КлючСлужебногоОбсуждения, ОбработкаСообщенийСервера);
	
КонецПроцедуры

Процедура ОбработкаСообщенийСервера(Сообщение, ДопПараметры) Экспорт
		
	Если ds_СлужебныеСообщения.ЭтаПодпискаДляСотрудникаИнтернетМагазина() Тогда
		ПоказатьОповещениеПользователя(
			Сообщение.Данные.Текст + Символы.ПС + Сообщение.Данные.Заказ, 
			ПолучитьНавигационнуюСсылку(Сообщение.Данные.Заказ),
			,
			БиблиотекаКартинок.ОбщаяКартинка54ФЗEmail_48,
			СтатусОповещенияПользователя.Важное);
	КонецЕсли;

КонецПроцедуры
