
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметрыДокументаОплаты(ЧекККМПродажа) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьПараметрыДокументаОплаты(ЧекККМПродажа);
	
КонецФункции

Функция ТорговыеТочкиОперации(ДокументОперации) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемами.ТорговыеТочкиОперации(ДокументОперации);
	
КонецФункции

Функция НастройкиТорговойТочки(Интеграция) Экспорт
	
	НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.НастройкиТорговойТочки(Интеграция);
	
	Возврат НастройкиИнтеграции;
	
КонецФункции

Функция СформироватьДанныеQRКода(Интеграция, Идентификатор, УникальныйИдентификатор) Экспорт 
	
	СтруктураКода = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СформироватьДанныеQRКода(Интеграция, 
																								Идентификатор, 
																								УникальныйИдентификатор);
	
	Возврат СтруктураКода;

КонецФункции

Функция ИдентификаторыОперацииОплаты(Интеграция, ДокументОплаты) Экспорт
	
	ИдентификаторОплаты = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ИдентификаторыОперацииОплаты(Интеграция, 
																											ДокументОплаты);
	
	Возврат ИдентификаторОплаты;
	
КонецФункции

Функция ПолучитьИдентификаторОплаты(ЗаявкаНаОплату, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование идентификатора оплаты.'");
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаОплату.ДокументОплаты) Тогда
		
		СтруктураНовойСсылки		  = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьСсылкуНовогоЧекаККМ();
		ЗаявкаНаОплату.ДокументОплаты = СтруктураНовойСсылки.ЧекККМВОбработке;
		
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ИдентификаторОплатыВПлатежнойСистеме",
		ЗаявкаНаОплату,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции
	
Функция ОпределитьСтатусОплатыОплаты(ДокументОплаты, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументОплаты", 	ДокументОплаты);
	ПараметрыПроцедуры.Вставить("Интеграция", 		Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса оплаты.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СтатусОплатыВПлатежнойСистеме",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВозвратОплаты(ЗаявкаНаВозврат, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Возврат оплаты в платежной системе.'");
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаВозврат.ДокументВозврата) Тогда
		
		СтруктураНовойСсылки		 	 = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьСсылкуНовогоЧекаККМ(Истина);
		ЗаявкаНаВозврат.ДокументВозврата = СтруктураНовойСсылки.ЧекККМВОбработке;
		
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ВозвратОплаты",
		ЗаявкаНаВозврат,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПодтвердитьВозврат(ДокументВозврата, Интеграция) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПодтвердитьВозврат(ДокументВозврата, Интеграция);
	
КонецФункции

Функция ОпределитьСтатусВозврата(ДокументВозврата, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументВозврата", ДокументВозврата);
	ПараметрыПроцедуры.Вставить("Интеграция",  		Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса возврата.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СтатусВозвратОплаты",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ОтменитьОперацию(ДокументОплаты, 
							Интеграция, 
							ИдентификаторЗаданияФормированияQRКода, 
							ИдентификаторЗаданияПроверкиСтатуса, 
							ИдентификаторЗаданияВозврата) Экспорт
	
	Результат = ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ОтменитьОперацию(ДокументОплаты, 
																					Интеграция, 
																					ИдентификаторЗаданияФормированияQRКода, 
																					ИдентификаторЗаданияПроверкиСтатуса, 
																					ИдентификаторЗаданияВозврата);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
