////////////////////////////////////////////////////////////////////////////////
// Подсистема "Коммерческие предложения документы".
// ОбщийМодуль.КоммерческиеПредложенияДокументыРТКлиент
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовФормы

// Выполняет действия при изменении номенклатуры в таблице Товары.
//
// Параметры:
//  Форма                   - ФормаКлиентскогоПриложения - Форма, в которой произошло событие.
//  ТекущаяСтрока           - ДанныеФормыЭлементКоллекции - Строка таблицы товаров.
//  ТекущийЭлемент - Строка - Имя изменившегося поля текущей строки,
//  ТребуетсяСерверныйВызов - Булево - Признак того, что необходим переопределяемый серверный вызов.
//
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, ТекущийЭлемент, ТребуетсяСерверныйВызов = Ложь) Экспорт
	
	Если ТипЗнч(ТекущаяСтрока[ТекущийЭлемент]) = Тип("СправочникСсылка.Номенклатура") Тогда 
		
		РеквизитыНоменклатуры = КоммерческиеПредложенияДокументыРТВызовСервера.РеквизитыНоменклатуры(ТекущаяСтрока[ТекущийЭлемент], "ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, РеквизитыНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ОткрытьФормуСпискаЗаказаПоставщику(Знач МассивСсылок) Экспорт
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ФиксированныеНастройки.Отбор,
				"Ссылка",
				МассивСсылок,
				ВидСравненияКомпоновкиДанных.ВСписке);
	
	ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки, ТолькоПросмотр", ФиксированныеНастройки, Истина);
	
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры


