

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("УжеПодобраны") Тогда
	Заказы.Параметры.УстановитьЗначениеПараметра("УжеПодобраны", Параметры.УжеПодобраны );
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийДокументПоставка") Тогда
	Заказы.Параметры.УстановитьЗначениеПараметра("ТекущийДокументПоставка", Параметры.ТекущийДокументПоставка );
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
  
  Если Элемент.ТекущиеДанные = Неопределено Тогда
		
  Иначе
		Элемент.ТекущиеДанные.Выбран = НЕ Элемент.ТекущиеДанные.Выбран;	
  КонецЕсли;
  
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		МассивЗаказов = ПолучитьОтобранныеЗаказы();
		Закрыть(МассивЗаказов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтобранныеЗаказы()
	тЗаказы = СписокВТЗнаСервере();
	массивЗаказов = новый Массив();
	Для Каждого стр из тЗаказы Цикл
		Если стр.Выбран Тогда
			массивЗаказов.Добавить(стр.Заказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат массивЗаказов;
КонецФункции

&НаСервере
Функция СписокВТЗнаСервере()

    Схема = Элементы.Заказы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Заказы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Возврат ТаблицаРезультат;
	
КонецФункции
