

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("УжеПодобраны") Тогда
	Заказы.Параметры.УстановитьЗначениеПараметра("УжеПодобраны", Параметры.УжеПодобраны );
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийДокументПоставка") Тогда
	Заказы.Параметры.УстановитьЗначениеПараметра("ТекущийДокументПоставка", Параметры.ТекущийДокументПоставка );
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
  
   СтандартнаяОбработка = Ложь;
    
  
   
        ДобавитьВПодбор(ВыбраннаяСтрока);
  
  
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПодбор(ВыбраннаяСтрока)

    ТЗ = ДанныеФормыВЗначение(ВыбранныеЗаказы, Тип("ТаблицаЗначений"));
    
    Строка = ТЗ.Найти(ВыбраннаяСтрока.Номер, "Номер");
    Если Строка = Неопределено Тогда
        Строка = ТЗ.Добавить();
    
        Строка.Номер = ВыбраннаяСтрока.Номер;
         Строка.Дата = ВыбраннаяСтрока.Дата;
                Строка.Сумма = ВыбраннаяСтрока.Сумма;
                Строка.НомерНаСайте = ВыбраннаяСтрока.НомерНаСайте;
                Строка.ДатаНаСайте = ВыбраннаяСтрока.ДатаНаСайте;
        		                Строка.Заказ = ВыбраннаяСтрока.Заказ;
        		
    КонецЕсли;
   
    ЗначениеВДанныеФормы(ТЗ, ВыбранныеЗаказы);

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	Закрыть(ПолучитьМассивЗаказов());
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаказов()
	ТЗ = ДанныеФормыВЗначение(ВыбранныеЗаказы, Тип("ТаблицаЗначений") );
	Возврат ТЗ.ВыгрузитьКолонку("Заказ"); 
КонецФункции


