
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает вид оплаты "Платежная карта" с привязкой к платежной системе "Сертификат НСПК".
//
Функция ВидОплатыПлатежнаяКартаНСПК() Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ВидОплатыПлатежнаяКартаНСПК();
	
КонецФункции

// Возвращает вид оплаты "Платежная система" с привязкой к платежной системе "Сертификат НСПК".
//
Функция ВидОплатыПлатежнаяСистемаНСПК() Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ВидОплатыПлатежнаяСистемаНСПК();
	
КонецФункции

// Возвращает общие параметры подключения к сервису НСПК.
//
// Возвращаемое значение:
//  Структура - содержит значения по ключам АдресСервисаНСПК, КлючДоступаНСПК.
//
Функция ОбщиеПараметрыПодключенияНСПК() Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ОбщиеПараметрыПодключенияНСПК();
	
КонецФункции

// Возвращает параметры операции НСПК по кассе.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ, для которой необходимо получить параметры операции;
//  ИдентификаторКорзины - Строка - идентификатор корзины для операции возврата;
//  ИдентификаторЗапроса - Строка - идентификатор запроса операции.
//
// Возвращаемое значение:
//  Структура - ЭлектронныеСертификатыНСПК.ПараметрыОперацииНСПК().
//
Функция ПараметрыОперацииНСПКПоКассеККМ(КассаККМ, ИдентификаторКорзины = "", ИдентификаторЗапроса = "0") Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ПараметрыОперацииНСПКПоКассеККМ(КассаККМ, ИдентификаторКорзины, ИдентификаторЗапроса);
	
КонецФункции

// Возвращает параметры подключения кассы к сервису НСПК.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ - Касса ККМ, для которой необходимо получить параметры подключения.
//
// Возвращаемое значение:
//  Структура - содержит значения по ключам ИдентификаторНСПК, КлючКассыНСПК.
//
Функция ПараметрыПодключенияКассыНСПК(КассаККМ) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ПараметрыПодключенияКассыНСПК(КассаККМ);
	
КонецФункции

// Возвращает параметры подключения организации к сервису НСПК.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить параметры подключения.
//
// Возвращаемое значение:
//  Структура - содержит значения по ключам КлючОрганизацииНСПК.
//
Функция ПараметрыПодключенияОрганизацииНСПК(Организация) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ПараметрыПодключенияОрганизацииНСПК(Организация);
	
КонецФункции

// Возвращает результат передачи подтверждения операции ЭС НСПК.
//
// Параметры:
//  ЧекККМ - ДокументСсылка.ЧекККМ - Чек ККМ, который необходимо отправить для подтверждения операции с ЭС НСПК.
//
// Возвращаемое значение:
//  СуммаСертификатамиНСПК - Число - сумма, оплаченная сертификатом.
//
Функция СуммаСертификатамиНСПК(ЧекККМ) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.СуммаСертификатамиНСПК(ЧекККМ);
	
КонецФункции

// Проверяет подтверждение оплаты электронным сертификатом или платежной картой
// в табличной части "Оплата" чека ККМ в НСПК.
//
// Параметры:
//  ЧекККМ - ДокументОбъект.ЧекККМ - Чек ККМ, который необходимо проверить;
//  Отказ - Булево - флаг отказа от продолжения операции проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиОплата(ЧекККМ, Отказ) Экспорт
	
	ЭлектронныеСертификатыНСПКРТ.ПроверитьЗаполнениеТабличнойЧастиОплата(ЧекККМ, Отказ);
	
КонецПроцедуры

// Создает виды оплат ЭС НСПК МИР и заполняет платежную систему если необходимо.
//
Процедура СоздатьВидыОплатНСПК() Экспорт
	
	Возврат;
	
КонецПроцедуры

// Получает параметры фискальной операции для отправки подтверждения в НСПК
// Параметры:
//  ЧекККМ - ДокументСсылка.ЧекККМ - ЧекККМ, для которого получаются параметры операции
//
Функция ПолучитьПараметрыФискальнойОперацииНСПК(ЧекККМ) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ПолучитьПараметрыФискальнойОперацииНСПК(ЧекККМ);
	
КонецФункции

// Проверяет возможность оплаты НСПК и возвращает форматированную строку
// с гиперссылками необходимых настроек
// Параметры:
//  ФормаРМК - ФормаКлиентскогоПриложения - Форма рабочего места кассира
//
Функция ПроверитьВозможностьОплатыНСПК(ФормаРМК) Экспорт
	
	Возврат ЭлектронныеСертификатыНСПКРТ.ПроверитьВозможностьОплатыНСПК(ФормаРМК);
	
КонецФункции

// Заполняет Организацию и КассуККМ по умолчанию
// для формы настроек НСПК.
//
// Параметры:
//  СтруктураОрганизацияКассаККМ - Структура с ключами Организация, КассаККМ;
//
Процедура ЗаполнитьЗначенияФормыНастроек(СтруктураОрганизацияКассаККМ) Экспорт
	
	ЭлектронныеСертификатыНСПКРТ.ЗаполнитьЗначенияФормыНастроек(СтруктураОрганизацияКассаККМ);
	
КонецПроцедуры

#КонецОбласти
