////////////////////////////////////////////////////////////////////////////////
// СкладскиеОперацииКлиентСервер содержит процедуры и функции для работы 
// со складскими операциями и обработки действий пользователя со складскими операциями.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает параметры для анализа пересортицы.
//
// Параметры:
//  ПараметрыАнализаПересортицы
//
// Возвращаемое значение:
//  Массив - массив параметров анализа пересортицы.
//
Функция МассивПараметровАнализаПересортицы(ПараметрыАнализаПересортицы) Экспорт
	
	МассивПараметровПоУмолчанию = СкладскиеОперацииКлиентСерверПовтИсп.МассивПараметровАнализаПересортицыПоУмолчанию();
	
	Если НЕ ЗначениеЗаполнено(ПараметрыАнализаПересортицы) Тогда
		Возврат МассивПараметровПоУмолчанию;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ПараметрыАнализаПересортицы);
	
	Для НомерСтроки = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		
		СтрокаПараметра = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);
		
		Если НЕ МассивПараметровПоУмолчанию.Найти(СтрокаПараметра) = Неопределено Тогда
			
			МассивПараметров.Добавить(СтрокаПараметра);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПараметров.Количество() = 0  Тогда
		Возврат МассивПараметровПоУмолчанию;
	КонецЕсли;
	
	Возврат МассивПараметров;
	
КонецФункции

#КонецОбласти