////////////////////////////////////////////////////////////////////////////////
// ПродажиВызовСервера содержит процедуры и функции 
// для обработки продаж.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на счет-фактуру по документу.
//
// Параметры:
//  Основание - ДокументСсылка - документ, на основании которого вводится счет-фактура;
//  Организация - СправочникСсылка.Организации - организация, на имя которой оформляется счет-фактура.
//  Проведен - Булево - признак проведения документа.
//
// Возвращаемое значение:
//  ДокументСсылка.СчетФактураВыданный, Неопределено - Ссылка на счет-фактуру по документу.
//  Если счет-фактура не найдена - Неопределено.
//
Функция СчетФактураДокумента(Основание, Организация = Неопределено, Проведен = Ложь) Экспорт
	
	Перем РеквизитыСчетаФактуры;
	
	Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Основание, Организация, РеквизитыСчетаФактуры, Проведен);
	
	Если РеквизитыСчетаФактуры <> Неопределено Тогда
		СчетФактураДокумента = РеквизитыСчетаФактуры.Ссылка;
	Иначе
		СчетФактураДокумента = Неопределено;
	КонецЕсли;
	
	Возврат СчетФактураДокумента;
	
КонецФункции

// Возвращает структуру значений кассовой дисциплины выемки при закрытии смены.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассаККМ - касса ККМ для получения кассовой дисциплины.
//
// Возвращаемое значение:
//  Структура - структура кассовой дисциплины.
//
Функция КассоваяДисциплинаВыемкиПриЗакрытииСмены(КассаККМ) Экспорт
	
	Возврат ПродажиСервер.КассоваяДисциплинаВыемкиПриЗакрытииСмены(КассаККМ);
	
КонецФункции

#КонецОбласти