#Область ПрограммныйИнтерфейс

// См. РаботаСоШтрихкодамиКлиентПереопределяемый.ОбработатьДанныеПоКоду.
Процедура ОбработатьДанныеПоКоду(Форма, СтруктураПараметровКлиента, ОткрытаБлокирующаяФорма) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураПараметровКлиента", СтруктураПараметровКлиента);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыбораДанныхПоиска", Форма, ДополнительныеПараметры);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДанныхПоискаПоШтрихкоду", СтруктураПараметровКлиента,,,,, ОбработчикОповещения, Режим); 
	ОткрытаБлокирующаяФорма = Истина;
	
КонецПроцедуры

#КонецОбласти