#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ПрименениеСистемНалогообложения.Форма.ФормаСписка.Открытие");
			 
	Склад = ПараметрКоманды;
	
	ЗначенияРеквизитов = ОбщегоНазначенияРТВызовСервера.ЗначенияРеквизитовОбъекта(
			Склад, 
			Новый Структура("Организация, Магазин"));		 
			
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.Организация) Тогда		
		Отбор = Новый Структура("Организация, Магазин, Склад", ЗначенияРеквизитов.Организация, ЗначенияРеквизитов.Магазин, Склад);
	Иначе
		Отбор = Новый Структура("Магазин, Склад", ЗначенияРеквизитов.Магазин, Склад);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ПрименениеСистемНалогообложения.ФормаСписка", 
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
