
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВариантаБезналичныеДС = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "БезналичныеДенежныеСредства");
	НастройкиВариантаБезналичныеДС.Описание = НСтр("ru = 'Информация об остатках и движении безналичных денежных средств'");
	НастройкиВариантаБезналичныеДС.Включен  = НЕ ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
