#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
	
	// Маг1С
	Маг1ССервер.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец Маг1С
	
	//{ds-18.01.2021
	ПараметрыСеанса.ds_РазрешитьРаботуHeado = Константы.ds_РазрешитьРаботуHeado.Получить();
	//}
	
	//{ds-24.08.2021
	ПараметрыСеанса.ds_ОбменСОфисом = Не ПланыОбмена.ds_ОбменСОфисом.НайтиПоРеквизиту("ЭтоГлавныйУзел", Истина).Пустая();
	//}
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли