#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Дата > ТекущаяДатаСеанса() Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
		
	Если Не ds_ОбщегоНазначенияВызовСервера.РольДоступнаТекущемуПользователю("ПолныеПрава") И Ссылка.Завершен Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Акт приемки завершен, изменение запрещено!",,,, Отказ);
	КонецЕсли;	
		
	Если ПометкаУдаления И ДокументыОснования.Количество() И Не Завершен Тогда 
		ДокументыОснования.Очистить();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли