
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	об = РеквизитФормыВЗначение("Объект");
  	об.ВосстановитьНастройкиВМодуле();
  	ЗначениеВРеквизитФормы(Об , "Объект")
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
		об = РеквизитФормыВЗначение("Объект");
  	об.СохранитьНастройкиВМодуле();
КонецПроцедуры


&НаКлиенте
Процедура ОтобразитьТоварыWB(Команда)
	 ОтобразитьТоварыWBНаСервере()
	
КонецПроцедуры

&НаСервере
Функция ОтобразитьТоварыWBНаСервере()
	
  	об = РеквизитФормыВЗначение("Объект");
  	об.ЗаполнитьСопоставлениеНоменклатуры();
	ЗначениеВРеквизитФормы(об,"Объект" );
	
КонецФункции


&НаКлиенте
Процедура СвязатьТовары(Команда)
	СвязатьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СвязатьТоварыНаСервере()
	  	об = РеквизитФормыВЗначение("Объект");
  	об.СвязатьТовары();
	ЗначениеВРеквизитФормы(об,"Объект" );
КонецПроцедуры


