#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СписокОбработкаЗаписиНовогоНаСервере(НовыйОбъект, ОбъектВладельцаФормы(ВладелецФормы).НаборСвойств);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СписокОбработкаЗаписиНовогоНаСервере(НовыйОбъект, НаборСвойств)
	РезультатПроверкиПравила = РаботаСПравиламиИменования.ПроверитьИспользованиеПравилаИменования(НовыйОбъект,,НаборСвойств);
	Если Не РезультатПроверкиПравила.Свойство("ПравилоНельзяИспользоватьДляНабора")
		ИЛИ Не ЗначениеЗаполнено(НаборСвойств) Тогда
		ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.Отбор, "Ссылка");
		Если ЭлементыОтбора.Количество() > 0 Тогда
			Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
				СписокПравил = ЭлементОтбора.ПравоеЗначение;
				СписокПравил.Добавить(НовыйОбъект);
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", СписокПравил);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОбъектВладельцаФормы(Знач ИскомоеСвойство)
	Если ТипЗнч(ИскомоеСвойство) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат ИскомоеСвойство.Объект;
	Иначе
		Возврат ОбъектВладельцаФормы(ИскомоеСвойство.Родитель);
	КонецЕсли;
КонецФункции

#КонецОбласти
