////////////////////////////////////////////////////////////////////////////////
// СкидкиНаценкиПовтИсп содержит процедуры и функции для работы 
// со скидками и обработки действий пользователя со скидками.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает объект внешнего отчета или обработки. 
// Проверка функциональной опции "ИспользоватьДополнительныеОтчетыИОбработки"
// должна выполняться вызывающим кодом.
//
// Параметры:
//  ВнешняяОбработка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Подключаемый отчет или обработка.
//
// Возвращаемое значение: 
//  * ВнешняяОбработкаОбъект - Объект подключенной обработки.
//  * ВнешнийОтчетОбъект     - Объект подключенного отчета.
//  * Неопределено           - Если передана некорректная ссылка.
//
Функция ОбъектВнешнейОбработки(ВнешняяОбработка) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ВнешняяОбработка);
	
КонецФункции

// Подключает внешнюю обработку (отчет).
// Подробнее - см. ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку().
//
// Параметры:
//  ВнешняяОбработка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Подключаемый отчет или обработка.
//
// Возвращаемое значение:
//  Строка - наименование внешней обработки.
//
Функция ПодключитьВнешнююОбработку(ВнешняяОбработка) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешняяОбработка);
	
КонецФункции

#КонецОбласти