#Область ПрограммныйИнтерфейс

// В процедуре требуется реализовать открытие формы нового документа инвентаризации (пересчета товаров).
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма запущенной обработки корректировки остатков,
//   ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - склад пересчета.
//
Процедура СоздатьПриказНаПроведениеИнвентаризации(Форма, ТорговыйОбъект) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Магазин", ТорговыйОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ПересчетТоваров.Форма.ФормаДокумента",
		ПараметрыФормы,
		Форма,
		Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// В процедуре требуется реализовать открытие формы списка документов инвентаризации (пересчета товаров).
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма запущенной обработки корректировки остатков,
//   ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - склад пересчета.
//
Процедура ОткрытьСписокИнвентаризаций(Форма, ТорговыйОбъект) Экспорт
	
	СтруктураБыстрогоОтбора = Новый Структура;
	СтруктураБыстрогоОтбора.Вставить("Магазин", ТорговыйОбъект);
	
	ПараметрыФормы = Новый Структура("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	ОткрытьФорму("Документ.ПересчетТоваров.Форма.ФормаДокумента",
		ПараметрыФормы,
		Форма,
		Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Формирует отчет по излишкам/недостачам для переданного торгового объекта.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма запущенной обработки корректировки остатков,
//   ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - склад пересчета.
//
Процедура СформироватьОтчетПоИзлишкамНедостачам(Форма, ТорговыйОбъект) Экспорт
	
	Отбор = Новый Структура("Магазин", ТорговыйОбъект);
	
	ПараметрыФормы = Новый Структура(
		"Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии",
		Отбор,
		"ОформлениеИзлишковНедостачКонтекст",
		"ОформлениеИзлишковНедостачКонтекст",
		Истина);
	
	ОткрытьФорму("Отчет.ОформлениеИзлишковНедостачТоваров.Форма",
		ПараметрыФормы,
		Форма,
		Форма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
