///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// При добавлении первой интеграции с Системой быстрых платежей должно быть
	// создано регламентное задание по загрузке идентификаторов платежных.
	УстановитьПривилегированныйРежим(Истина);
	ИнтеграцияСПлатежнымиСистемамиСлужебный.ДобавитьЗаданиеЗагрузкиСтатусовОперацийСБП();
	УстановитьПривилегированныйРежим(Ложь);
	
	// При добавлении первой интеграции, для которой поддерживается сверка взаиморасчетов
	// должно быть создано задание загрузки отчетов по сверке оборотов.
	Если Не ЭтоГруппа И СверкаВзаиморасчетов Тогда
		МодульСверкаВзаиморасчетовПлатежныеСистемы = ОбщегоНазначения.ОбщийМодуль("СверкаВзаиморасчетовПлатежныеСистемы");
		МодульСверкаВзаиморасчетовПлатежныеСистемы.ДобавитьЗаданиеСверкаВзаиморасчетовПоОборотам();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
