
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	ОбработатьПолученныеДанные(Штрихкод, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоМагнитномуКоду(ТекКод, ДополнительныеПараметры) Экспорт
	
	ОбработатьПолученныеДанные(ТекКод, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ЧислоВвода") Тогда
		ЧислоВвода    = Параметры.ЧислоВвода;
		ВводимоеЧисло = Формат(ЧислоВвода, "ЧЦ=10; ЧДЦ=; ЧВН=; ЧГ=0");
		Если НЕ ПустаяСтрока(ВводимоеЧисло) Тогда
			КодТелефона = Сред(ВводимоеЧисло, 1, 3);
			НомерТелефонаЧасть1 = Сред(ВводимоеЧисло, 4, 3);
			НомерТелефонаЧасть2 = Сред(ВводимоеЧисло, 7, 2);
			НомерТелефонаЧасть3 = Сред(ВводимоеЧисло, 9, 2);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Отрицательное") Тогда
		Отрицательное = Параметры.Отрицательное;
	КонецЕсли;
	
	Если Параметры.Свойство("ВозвращатьЧислоСтрокой") Тогда
		ВозвращатьЧислоСтрокой = Параметры.ВозвращатьЧислоСтрокой;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтказКлиентаОтСохраненияТелефона") Тогда
		ОтказКлиентаОтСохраненияТелефона = Параметры.ОтказКлиентаОтСохраненияТелефона;
	КонецЕсли;
	
	Если Параметры.Свойство("ДисконтнаяКарта") Тогда
		ДисконтнаяКарта = Параметры.ДисконтнаяКарта;
	КонецЕсли;
	
	ПодключаемоеОборудованиеРТ.ПолучитьДоступноеПодключаемоеОборудование(ИспользоватьПодключаемоеОборудование, ЕстьТСД, ЕстьВесы);
	
	ОбработатьДисконтнуюКарту();
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПраваяКлавиатура;
	ТекущийЭлемент = Элементы.Команда9ПраваяКлавиатура;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	ПоддерживаемыеТипыОборудования = "СканерШтрихкода, СчитывательМагнитныхКарт";
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, ПоддерживаемыеТипыОборудования);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудованияРМК(ЭтотОбъект, Источник, Событие, Данные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимоеЧисло = "";
	КодТелефона = "";
	НомерТелефонаЧасть1 = "";
	НомерТелефонаЧасть2 = "";
	НомерТелефонаЧасть3 = "";
	ПервыйВвод = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ЗакрытьСПередачейРезультата();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранениеЗначения(Команда)
	
	ОтказКлиентаОтСохраненияТелефона = НЕ ОтказКлиентаОтСохраненияТелефона;
	ВывестиКартинкуСохраненияТелефонаКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеВводимоеЧислоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВводимоеЧисло        = ВыбранноеЗначение;
	Если НЕ ПустаяСтрока(ВводимоеЧисло) Тогда
		КодТелефона = Сред(ВводимоеЧисло, 1, 3);
		НомерТелефонаЧасть1 = Сред(ВводимоеЧисло, 4, 3);
		НомерТелефонаЧасть2 = Сред(ВводимоеЧисло, 7, 2);
		НомерТелефонаЧасть3 = Сред(ВводимоеЧисло, 9, 2);
	КонецЕсли;
	ЧислоВвода = ПривестиСтрокуКЧислуСервер(ВводимоеЧисло, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		КодТелефона = "";
		НомерТелефонаЧасть1 = "";
		НомерТелефонаЧасть2 = "";
		НомерТелефонаЧасть3 = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Если СтрДлина(КодТелефона) = 3 Тогда
		Если СтрДлина(НомерТелефонаЧасть1) = 3 Тогда
			Если СтрДлина(НомерТелефонаЧасть2) = 2 Тогда
				НомерТелефонаЧасть3 = НомерТелефонаЧасть3 + ВведеннаяЦифраСтрокой;
				Если СтрДлина(НомерТелефонаЧасть3) = 2 Тогда
					ТекущийЭлемент = Элементы.КомандаEnterПраваяКлавиатура;
				КонецЕсли;
			Иначе
				НомерТелефонаЧасть2 = НомерТелефонаЧасть2 + ВведеннаяЦифраСтрокой;
			КонецЕсли;
		Иначе
			НомерТелефонаЧасть1 = НомерТелефонаЧасть1 + ВведеннаяЦифраСтрокой;
		КонецЕсли;
	Иначе
		КодТелефона = КодТелефона + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	ВводимоеЧисло = КодТелефона + НомерТелефонаЧасть1 + НомерТелефонаЧасть2 + НомерТелефонаЧасть3;
	
	ЧислоВвода = ПривестиСтрокуКЧислу(ВводимоеЧисло, Истина);
	
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	Если ЗначениеЗаполнено(ЧислоСтрокой) Тогда
		ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
		ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	Иначе
		ЗначениеЧисла = 0;
	КонецЕсли;
		
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата()
	
	СтруктураОтвета = Новый Структура;
	
	Если НЕ ДанныеКорректны(ВводимоеЧисло) Тогда
		ЗаголовокИнформации = НСтр("ru = 'Введите телефон корректно'");
		ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, ВводимоеЧисло);
		Возврат;
	КонецЕсли;
	
	Если ВозвращатьЧислоСтрокой Тогда
		СтруктураОтвета.Вставить("ВведенноеЧисло", ВводимоеЧисло);
	Иначе
		СтруктураОтвета.Вставить("ВведенноеЧисло", ПривестиСтрокуКЧислу(ВводимоеЧисло, Истина));
	КонецЕсли;
	СтруктураОтвета.Вставить("ОтказКлиентаОтСохраненияТелефона", ОтказКлиентаОтСохраненияТелефона);
	
	Закрыть(СтруктураОтвета)
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДисконтнуюКарту()
	
	Если ЗначениеЗаполнено(ДисконтнаяКарта) Тогда
		
		СписокТелефонов = ПодключаемоеОборудованиеРТ.ТелефоныОбъектаДляЧека(ДисконтнаяКарта);
		
		ЕстьНомер = Ложь;
		Для каждого НомерТелефона Из СписокТелефонов Цикл
			
			Если НЕ ЗначениеЗаполнено(ВводимоеЧисло) Тогда
				ВводимоеЧисло = НомерТелефона.Значение;
				КодТелефона = Сред(ВводимоеЧисло, 1, 3);
				НомерТелефонаЧасть1 = Сред(ВводимоеЧисло, 4, 3);
				НомерТелефонаЧасть2 = Сред(ВводимоеЧисло, 7, 2);
				НомерТелефонаЧасть3 = Сред(ВводимоеЧисло, 9, 2);
				ЧислоВвода = ПривестиСтрокуКЧислуСервер(НомерТелефона.Значение, Истина);
			КонецЕсли;
			
			Элементы.ПолеВводимоеЧисло.СписокВыбора.Добавить(НомерТелефона.Значение, НомерТелефона.Представление);
			ЕстьНомер = Истина;
			
		КонецЦикла;
		
		Если ЕстьНомер Тогда
			Элементы.ПолеВводимоеЧисло.КнопкаВыпадающегоСписка = Истина;
			Элементы.ПолеВводимоеЧисло.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке;
		КонецЕсли;
		
		Элементы.ПолеКартинкаПустая.Видимость = Ложь;
		Элементы.ПолеКартинкаПустаяПраваяКлавиатура.Видимость = Ложь;
		ВывестиКартинкуСохраненияТелефонаСервер();
		Элементы.КомандаСохранениеЗначения.Видимость = Истина;
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Видимость = Истина;
	Иначе
		Элементы.ПолеКартинкаПустая.Видимость = Истина;
		Элементы.ПолеКартинкаПустаяПраваяКлавиатура.Видимость = Истина;
		Элементы.КомандаСохранениеЗначения.Видимость = Ложь;
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПривестиСтрокуКЧислуСервер(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаКлиенте
Процедура ВывестиКартинкуСохраненияТелефонаКлиент()
	
	Если ОтказКлиентаОтСохраненияТелефона Тогда
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Картинка = БиблиотекаКартинок.НеСохранять32;
		Элементы.КомандаСохранениеЗначения.Картинка = БиблиотекаКартинок.НеСохранять32;
	Иначе
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Картинка = БиблиотекаКартинок.Сохранить32;
		Элементы.КомандаСохранениеЗначения.Картинка = БиблиотекаКартинок.Сохранить32;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКартинкуСохраненияТелефонаСервер()
	
	Если ОтказКлиентаОтСохраненияТелефона Тогда
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Картинка = БиблиотекаКартинок.НеСохранять32;
		Элементы.КомандаСохранениеЗначения.Картинка = БиблиотекаКартинок.НеСохранять32;
	Иначе
		Элементы.КомандаСохранениеЗначенияПраваяКлавиатура.Картинка = БиблиотекаКартинок.Сохранить32;
		Элементы.КомандаСохранениеЗначения.Картинка = БиблиотекаКартинок.Сохранить32;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДанные(Знач Телефон)
	
	Возврат ШтрихкодированиеРТКлиентСервер.ПодготовитьТелефон(Телефон);
	
КонецФункции

&НаКлиенте
Функция ДанныеКорректны(Данные)
	
	Возврат ШтрихкодированиеРТКлиентСервер.ТелефонКорректен(НСтр("ru = '7'") + Данные);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолученныеДанные(Данные, ДополнительныеПараметры)
	Если НЕ ПустаяСтрока(Данные) Тогда
		
		// Подготовка штрихкода
		Телефон = ПодготовитьДанные(Данные);
		
		// Проверка считанных данных
		Если НЕ ДанныеКорректны(Телефон) Тогда
			ЗаголовокИнформации = НСтр("ru = 'Считан некорректный телефон'");
			ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМКУправляемой(ЗаголовокИнформации, Телефон);
			Возврат;
		КонецЕсли;
		
		ВводимоеЧисло = Телефон;
		Если НЕ ПустаяСтрока(ВводимоеЧисло) Тогда
			КодТелефона = Сред(ВводимоеЧисло, 1, 3);
			НомерТелефонаЧасть1 = Сред(ВводимоеЧисло, 4, 3);
			НомерТелефонаЧасть2 = Сред(ВводимоеЧисло, 7, 2);
			НомерТелефонаЧасть3 = Сред(ВводимоеЧисло, 9, 2);
		КонецЕсли;
		ЧислоВвода = ПривестиСтрокуКЧислуСервер(ВводимоеЧисло, Истина);
		
	КонецЕсли;
КонецПроцедуры
 
#КонецОбласти