

#Область ПрограммныйИнтерфейс

// Заполняет данные пользователя по ссылке для сопоставления с сервисом.
// 
// Параметры:
//  ДанныеПользователя - Структура - Данные пользователя, которые необходимо заполнить.
//    * Идентификатор - Строка - Идентификатор пользователя, по которому его можно однозначно идентифицировать в информационной базе.
//    * ФИО - Строка - ФИО пользователя.
//  Пользователь - ОпределяемыйТип.ПользовательEDI - Ссылка на пользователя, по которому требуется заполнить данные.
//
Процедура ЗаполнитьДанныеПользователя(ДанныеПользователя, Знач Пользователь) Экспорт
	
КонецПроцедуры

// Заполняет пользователя информационной базы по идентификатору.
// 
// Параметры:
//  Пользователь - ОпределяемыйТип.ПользовательEDI - Ссылка на пользователя, по которому требуется заполнить данные.
//  Идентификатор - Строка - Идентификатор пользователя, по которому его можно однозначно идентифицировать в информационной базе.
//
Процедура НайтиПользователяПоИдентификатору(Пользователь, Знач Идентификатор) Экспорт
	
КонецПроцедуры

#КонецОбласти
