#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(Отказ,,Организация);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(,,Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
