
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ВладелецСерии", ВладелецСерий(ПараметрКоманды));
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ВладелецСерий(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		
		Возврат ПараметрКоманды;
	Иначе // Это номенклатура
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ВидНоменклатуры");
		ИспользованиеСерий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеСерий");
		
		Если ИспользованиеСерий = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры Тогда
			Возврат ПараметрКоманды;
		Иначе
			Возврат ВидНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции