#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		ТекстЗаголовка = НСтр("ru = 'Типы выемки при закрытии смены'");
		Если Параметры.Отбор.Свойство("Магазин") И ТипЗнч(Параметры.Отбор.Магазин) = Тип("СправочникСсылка.Магазины") Тогда
			Элементы.Магазин.Видимость = Ложь;
			ТекстЗаголовка = ТекстЗаголовка + ": " + Строка(Параметры.Отбор.Магазин);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("Организация") И ТипЗнч(Параметры.Отбор.Организация) = Тип("СправочникСсылка.Организации") Тогда
			Элементы.Организация.Видимость = Ложь;
			ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(Параметры.Отбор.Организация) + ")";
		КонецЕсли;
		
		АвтоЗаголовок = Ложь;
		Заголовок     = ТекстЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
       
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.КассоваяДисциплинаВыемкиПриЗакрытииСмены.Форма.ФормаСписка.Открытие");

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.КассоваяДисциплинаВыемкиПриЗакрытииСмены.Форма.ФормаЗаписи.Открытие");

КонецПроцедуры

#КонецОбласти