&НаКлиенте
Процедура ОткрытьФормуВыбораЗаказаПокупателя()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийДокументПоставка", Объект.Ссылка);
	ПараметрыФормы.Вставить("УжеПодобраны", ПолучитьПодобранныеЗаказы());
	
	Обработчик = Новый ОписаниеОповещения("ОповещениеПодборЗаказов", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("Документ.ds_ПоставкаWB.Форма.ФормаПодбораЗаказов", ПараметрыФормы, ЭтотОбъект, , , , Обработчик,
		Режим);

КонецПроцедуры

&НаСервере
Функция ПолучитьПодобранныеЗаказы()
	ТЗ  = Объект.Заказы.Выгрузить();
	Возврат тз.ВыгрузитьКолонку("Заказ");
КонецФункции

&НаКлиенте
Процедура ОповещениеПодборЗаказов(МассивЗаказов,ДополнительныеПараметры) Экспорт
	Если МассивЗаказов <> Неопределено Тогда
		ЗаполнитьЗаказы(МассивЗаказов);
		ЗаполнитьТовары(МассивЗаказов);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(МассивЗаказов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток,
	|	ЗаказыПокупателейОстатки.Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ В (&МассивЗаказов)) КАК ЗаказыПокупателейОстатки";

	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = 	Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = Выборка.ЗаказаноОстаток;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(МассивЗаказов)
	Для Каждого ВыбранныйЗаказ Из МассивЗаказов Цикл
		НоваяСтрока = Объект.Заказы.Добавить();
		НоваяСтрока.ДатаМаркетплейса = ВыбранныйЗаказ.ДатаЗаказаНаСайте;
		НоваяСтрока.Заказ = ВыбранныйЗаказ;
		НоваяСтрока.Сумма = ВыбранныйЗаказ.СуммаДокумента;
	КонецЦикла;
КонецПроцедуры