&НаКлиенте
Процедура ОткрытьФормуВыбораЗаказаПокупателя()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийДокументПоставка", Объект.Ссылка);
	ПараметрыФормы.Вставить("УжеПодобраны", ПолучитьПодобранныеЗаказы());
	
	Обработчик = Новый ОписаниеОповещения("ОповещениеПодборЗаказов", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("Документ.ds_ПоставкаWB.Форма.ФормаПодбораЗаказов", ПараметрыФормы, ЭтотОбъект, , , , Обработчик,
		Режим);

КонецПроцедуры

&НаСервере
Функция ПолучитьПодобранныеЗаказы()
	ТЗ  = Объект.Заказы.Выгрузить();
	Возврат тз.ВыгрузитьКолонку("Заказ");
КонецФункции

&НаКлиенте
Процедура ОповещениеПодборЗаказов(МассивЗаказов) Экспорт
	Если МассивЗаказов <> Неопределено Тогда
		ЗаполнитьЗаказы(МассивЗаказов);
		ЗаполнитьТовары(МассивЗаказов);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(МассивЗаказов)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МассивЗаказов.Заказ КАК Документ.ЗаказПокупателя) КАК Заказ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВременнаяТаблица КАК МассивЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ИЗ
	|	Товары КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура";

	Запрос.УстановитьПараметр("ВременнаяТаблица", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = 	Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = Выборка.Количество;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(МассивЗаказов)
	Для Каждого стр Из МассивЗаказов Цикл
		НоваяСтрока = Объект.Заказы.Добавить();
		НоваяСтрока.ДатаМаркетплейса = стр.ДатаМаркетплейса;
		НоваяСтрока.Заказ = стр.Заказ;
		НоваяСтрока.Сумма = стр.Сумма;
	КонецЦикла;
КонецПроцедуры