
Процедура СетьМагазинов_ВМагазинОбработкаПолученияСообщения(Сообщение, Отказ)
	
	Если СтрНайти(Сообщение.КодПолучателя, ПланыОбмена.ds_ОбменСОфисом.ЭтотУзел().Код) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("ExchangeMPR", Истина);
	ИмяОбработки = ВнешниеОбработки.Подключить(ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "ХранилищеОбработки"),, Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
	
	РазмерСообщения = Сообщение.Параметры.Получить("РазмерСообщения"); 
	Если РазмерСообщения <> Неопределено Тогда 
		РазмерБуфера = Число(РазмерСообщения); 
	Иначе    
		РазмерБуфера = 1024; 
	КонецЕсли; 
	
	Тело = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера); 
	
	Поток = Сообщение.ПолучитьТелоКакПоток(); 
	
	Пока Истина Цикл   
		Попытка
			Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
		Исключение
			Возврат;
		КонецПопытки;
		
		Если Прочитано > 0 Тогда
			Тело = Тело.Соединить(Буфер); 
		КонецЕсли;
		Если Прочитано < РазмерБуфера Тогда  
			Прервать;  
		КонецЕсли; 
	КонецЦикла; 
	
	СтрокаСообщения = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело); 
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
	Данные = ПрочитатьJSON(ЧтениеJson);
	
	Отправитель = ПланыОбмена.ds_ОбменСОфисом.НайтиПоКоду(Данные.Отправитель);
	Если Отправитель.Пустая() Тогда
		Возврат;
	КонецЕсли;	
		
	ТипСообщения = Сообщение.Параметры.Получить("ТипСообщения");  
	Если ТипСообщения = "Обмен" Тогда
		Если Не Отправитель.ПропускатьСообщения Тогда 
			Обработка.ЗагрузитьИзмененияОтЦБ(Данные);
		КонецЕсли;	
		
		Узел = Отправитель.ПолучитьОбъект();
		Узел.Версия = Данные.Версия;
		Узел.НомерПринятого = Число(Данные.НомерОтправленного);
		Узел.ДатаОбмена = ТекущаяДата();
		Узел.Записать();
	ИначеЕсли ТипСообщения = "СверкаОстатков" Тогда
		Если Не Отправитель.ПропускатьСообщения Тогда
			НомерСообщения = Сообщение.Параметры.Получить("НомерСообщения");
			Если НомерСообщения = "1" Тогда 
				Обработка.ПрочитатьСообщение1ВМагазине(Данные);
			ИначеЕсли НомерСообщения = "3" Тогда 
				Обработка.ПрочитатьСообщение3ВМагазине(Данные);	
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ТипСообщения = "ПроизвольныйКод" Тогда
		Попытка		
			Выполнить(Данные.ПроизвольныйКод);	
		Исключение
			//todo
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры
