////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными XDTO"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет массив планов обмена, которые используют функционал подсистемы обмена данными по формату XDTO.
//
// Параметры:
//  ПланыОбменаXDTO - Массив - массив планов обмена , подлежащий дополнению.
//                    Элементами массива являются объекты метаданных планов обмена
//                    (например Метаданные.ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30).
//
Процедура СписокПлановОбменаXDTO(ПланыОбменаXDTO) Экспорт
	ПланыОбменаXDTO.Добавить(Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат);
	
	ИнтеграцияУРМКПереопределяемый.ПланОбменаУРМК(ПланыОбменаXDTO);
КонецПроцедуры

#КонецОбласти
