#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет предопределенные элементы статей движения денежных средств.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.Наличные,
		Перечисления.ТипыОплатЧекаККМ.Наличные);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаБонусамиКакСкидкой,
		Перечисления.ТипыОплатЧекаККМ.Бонусы);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаПодарочнымСертификатом,
		Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ОплатаВРассрочку,
		Перечисления.ТипыОплатЧекаККМ.ВРассрочку);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ЗачетАванса,
		Перечисления.ТипыОплатЧекаККМ.ЗачетАванса);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.БанковскийПлатеж,
		Перечисления.ТипыОплатЧекаККМ.БанковскийПлатеж);
	Соответствие.Вставить(Справочники.ВидыОплатЧекаККМ.ВстречноеПредоставление,
		Перечисления.ТипыОплатЧекаККМ.ВстречноеПредоставление);
		
	Для Каждого Элемент Из Соответствие Цикл
	
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		Если НЕ СправочникОбъект.ТипОплаты = Элемент.Значение Тогда
			СправочникОбъект.ТипОплаты = Элемент.Значение;
			Попытка
				СправочникОбъект.УстановитьНовыйКод();
				СправочникОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Заполнение предопределенных'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//  Массив - массив нередактируемых реквизитов.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	НеРедактируемыеРеквизиты.Добавить("ТипОплаты");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
