////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияРТКлиентСерверПовтИсп содержит процедуры и функции 
// общего назначения для работы с конфигурацией.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает склонение в выбранном падеже.
//
// Параметры:
//  ФИО		- Строка - Строка, в которой содержится ФИО для склонения.
//  Падеж 	- Число - падеж, в который необходимо просклонять представление объекта.
//							1 - Именительный.
//							2 - Родительный.
//							3 - Дательный.
//							4 - Винительный.
//							5 - Творительный.
//							6 - Предложный.
//  Объект 	- ОбъектСклонения - Ссылка на объект, реквизит которого склоняется.
//  Пол		- Число - Число - пол физического лица, 
//							1 - мужской, 
//							2 - женский.
//
// Возвращаемое значение:
//  Строка - Результат склонения ФИО в падеже.
//
Функция ПолучитьСклонениеФИО(ФИО, Падеж, Пол = Неопределено) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		ЭтоLinuxСервер = ЭтоLinuxСервер();
	#Иначе
		ЭтоLinuxСервер = ОбщегоНазначенияРТВызовСервера.ЭтоLinuxСервер();
	#КонецЕсли
	
	Если ЭтоLinuxСервер Тогда
		Возврат ФИО;
	Иначе
		Возврат ОбщегоНазначенияРТВызовСервера.ПросклонятьФИО(ФИО, Падеж, Пол);
	КонецЕсли;
	
КонецФункции

// Возвращает Истина, если сервер запущен на Linux.
//
// Возвращаемое значение:
//  Булево - признак использования Linux сервера.
//
Функция ЭтоLinuxСервер() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxСервер = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	Возврат ЭтоLinuxСервер;
КонецФункции

// Возвращает формат суммовых показателей
//
// Возвращаемое значение:
//  Формат - формат показателей.
//
Функция ФорматСуммовыхПоказателей() Экспорт
	
	Формат = "ЧДЦ=2; ЧН=0,00";
	Возврат Формат;
	
КонецФункции

// Возвращает код валюты.
//
// Возвращаемое значение:
//  Число - код валюты.
//
Функция КодВалюты() Экспорт
	
	Возврат ОбщегоНазначенияРТКлиентСервер.КодВалюты();
КонецФункции

// Возвращает представление валюты.
//
// Возвращаемое значение:
//  Строка - представление валюты.
//
Функция Валюта() Экспорт
	
	Возврат ОбщегоНазначенияРТКлиентСервер.Валюта();
КонецФункции

#КонецОбласти

