
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет относится ли считанный штрихкод к весовым товарам.
//
// Параметры
//  ЭтоШтрихкодПоШаблону - Булево - возвращаемое значение. Истина, если штрихкод относится к весовым товарам.
//  Штрихкод - Строка - штрихкод для разбора.
//  ДанныеРазбора - Структура - возвращаемое значение. Результат разбора штрихкода по шаблону,
//                              если штрихкод соответствует шаблону весовых товаров, иначе структура остается пустой.
//     * РезультатРазбораПоШаблону - Структура - данные разбора.
//          * ЭтоФасованныйТовар - Булево - признак фасованного товара.
//          * КодОборудования - Число - код товара SKU.
//          * Количество - Число - вес товара.
//
Процедура РазобратьШтрихкодПоШаблону(ЭтоШтрихкодПоШаблону, Штрихкод, ДанныеМаркировки) Экспорт
	
	ШтрихкодированиеРМКРТ.РазобратьШтрихкодПоШаблону(ЭтоШтрихкодПоШаблону, Штрихкод, ДанныеМаркировки);
	
КонецПроцедуры

// Возвращает представление единицы измерения номенклатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для которой необходимо получить представление единицы измерения.
//
// ВозвращаемоеЗначение:
//  ПредставлениеЕдиницыИзмерения - Строка - представление единицы измерения номенклатуры.
//
Функция ПредставлениеЕдиницыИзмерения(Номенклатура) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.ПредставлениеЕдиницыИзмерения(Номенклатура);
	
КонецФункции

// Поиск кассира по считанному коду.
//
// Параметры
//  Объект - ДанныеФормыСткруктура - форма, в которой переопредляются значения.
//  Штрихкод - Строка - код, по которому выполняется поиск.
//
Процедура ВыполнитьПоискКассира(Объект, Штрихкод) Экспорт
	
	ШтрихкодированиеРМКРТ.ВыполнитьПоискКассира(Объект, Штрихкод);
	
КонецПроцедуры

// Возвращает структуру кассира если владельцем является пользователь или физическое лицо.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//
// ВозвращаемоеЗначение:
//  Структура - содержащая данные кассира
//
Функция НайденныйКассир(ВладелецШтрихкода, Форма) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НайденныйКассир(ВладелецШтрихкода, Форма);
	
КонецФункции

// Возвращает структуру дисконтной карты если владельцем является карта лояльности.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//
// ВозвращаемоеЗначение:
//  Структура - содержащая данные карты лояльности
//
Функция НайденнаяКартаЛояльности(ВладелецШтрихкода) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НайденнаяКартаЛояльности(ВладелецШтрихкода);
	
КонецФункции

// Возвращает структуру дисконтной карты
//
// Параметры:
//  МагнитныйКод - Строка - код, по которому выполняется поиск;
//  НомерТелефона - Строка - (необязательный) номер телефона владельца карты
//
// Возвращаемое значение:
//  Результат - Структура,Неопределено - Параметры дисконтной карты, или Неопределено если карта не найдена
//
Функция ДанныеКартыЛояльностиПоМагнитномуКоду(МагнитныйКод, НомерТелефона = Неопределено) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.ДанныеКартыЛояльностиПоМагнитномуКоду(МагнитныйКод, НомерТелефона);
	
КонецФункции

// Возвращает найденный товар или товары по переданным исходным данным
//
// Параметры:
//  Штрихкод - Строка - штрихкод для поиска номенклатуры;
//  ВидЦены - СправочникСсылка.ВидыЦен - вид цены (розничная цена);
//  СистемаНалогообложения - ПеречислениеСсылка.ТипыСистемНалогообложенияККТ - система налогообложения;
//  ДанныеМаркировки - Структура:
//		* EAN - Строка;
//		* GTIN - Строка;
//
// Возвращаемое значение:
//  Результат - Выборка, ТаблицаЗначений
//
Функция ВыполнитьПоискТовара(Штрихкод, ВидЦены, СистемаНалогообложения, ДанныеМаркировки = Неопределено) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.ВыполнитьПоискТовара(Штрихкод, ВидЦены, СистемаНалогообложения, ДанныеМаркировки);
	
КонецФункции

// Возвращает сведения о существующей для номенклатуры упаковки
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для запроса информации об упаковке
//
// Возвращаемое значение:
//  Результат - Структура
//		*Коэффициент - Число - коэффициент кратности упаковки
//		*Упаковка - СправочникСсылка.Упаковки - найденная упаковка для номенклатуры
//
Функция ДанныеУпаковкиДляТовара(Номенклатура) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.ДанныеУпаковкиДляТовара(Номенклатура);
	
КонецФункции

// Возвращает структуру позиции номенклатуры если владельцем является номенклатура.
//
// Параметры:
//  СтрокаРезультата - Структура - параметры для проверки и заполнения.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ПараметрыДляОбработкиШтрихкода - Структура - данные для обработки штрихкода.
//
// ВозвращаемоеЗначение:
//  Структура - содержащая данные номенклатуры
//     * Весовой - Булево
//     * Количество - Число
//     * КоличествоУпаковок - Число
//     * Маркируемый - Булево
//     * НеобходимостьВводаСерии - Булево
//     * Номенклатура - ОпределяемыйТип.НоменклатураРМК
//     * ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК
//     * ПредставлениеНоменклатураХарактеристика - Строка
//     * Серия - ОпределяемыйТип.СерияРМК
//     * СистемаНалогообложения - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК
//     * СтавкаНДС - ОпределяемыйТип.СтавкаНДСРМК
//     * ТипНоменклатуры - ОпределяемыйТип.ТипыНоменклатурыРМК
//     * Упаковка - ОпределяемыйТип.УпаковкаРМК
//     * Фасованный - Булево
//     * Характеристика - ОпределяемыйТип.ХарактеристикаРМК
//     * Цена - Число
//     * Штрихкод - Строка
//     * Организация - ОпределяемыйТип.ОрганизацияРМК
//
Функция НайденнаяНоменклатура(СтрокаРезультата, Форма, ПараметрыДляОбработкиШтрихкода) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НайденнаяНоменклатура(СтрокаРезультата, Форма, ПараметрыДляОбработкиШтрихкода);
	
КонецФункции

// Возвращает серию номенклатуры если ею является.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//
// ВозвращаемоеЗначение:
//  СправочникСсылка.СерииНоменклатуры
//
Функция НайденнаяСерияНоменклатуры(ВладелецШтрихкода) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НайденнаяСерияНоменклатуры(ВладелецШтрихкода);
	
КонецФункции

// Возвращает партию номенклатуры если ею является.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//
// ВозвращаемоеЗначение:
//  СправочникСсылка.ПартииНоменклатуры
//
Функция НайденнаяПартияНоменклатуры(ВладелецШтрихкода) Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НайденнаяПартияНоменклатуры(ВладелецШтрихкода);
	
КонецФункции

// Возвращает признак того, нужно ли проверять статус акцизной марки.
//
// ВозвращаемоеЗначение:
//  Истина - если нужна проверка статуса марки.
//
Функция НужнаПроверкаСтатусаМарки() Экспорт
	
	Возврат ШтрихкодированиеРМКРТ.НужнаПроверкаСтатусаМарки();
	
КонецФункции

// Проверка статуса марки.
//
// Параметры
//  ПараметрыПроверки - Структура - параметры для проверки марки.
//
Процедура ПроверитьСтатусМарки(ПараметрыПроверки) Экспорт
	
	ШтрихкодированиеРМКРТ.ПроверитьСтатусМарки(ПараметрыПроверки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
