////////////////////////////////////////////////////////////////////////////////
// Модуль "ЦенообразованиеВызовСервера", содержит процедуры и функции для  проверки 
// корректности документов установки цен и для обработки 
// пользователем введенных данных.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывает функцию округления числа общего модуля Ценообразование.
//
// Параметры:
//  Число                    - Число - исходное число.
//  ТочностьОкругления       - Число - определяет точность округления.
//  ОкруглятьВБольшуюСторону - Булево - определяет способ округления: если Истина, 
//                                      то при округлении с точностью до 1, 0.01 будет округлено до 1, 
//                                      Ложь - округление по арифметическим правилам.
//
// Возвращаемое значение:
//  Число - исходное число, округленное с заданной точностью.
//
Функция ОкруглитьЦену(Число, ТочностьОкругления, ОкруглятьВБольшуюСторону) Экспорт
	
	Возврат Ценообразование.ОкруглитьЦену(Число, ТочностьОкругления, ОкруглятьВБольшуюСторону);
	
КонецФункции

// Вызывает функцию формирования текста для сообщений общего модуля Ценообразование.
//
// Параметры:
//  ИмяТЧ - Строка - Имя табличной части.
//  НомерСтроки - Число - Номер строки табличной части.
//  ИмяРеквизита - Строка - Имя реквизита.
//
// Возвращаемое значение:
//  Строка - текст для выдачи сообщений.
//
Функция ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ(ИмяТЧ, НомерСтроки, ИмяРеквизита) Экспорт

	Возврат Ценообразование.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ(ИмяТЧ, НомерСтроки, ИмяРеквизита);
	
КонецФункции

// Проверка на использование характеристик и получение владельца для выбора.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенлатура для проверки использования характеристик.
//  ВладелецХарактеристики - СправочникСсылка.Номенклатура,
//                           СправочникСсылка.ВидыНоменклатуры - владелец номенклатуры.
//  
// Возвращаемое значение:
//  Булево - признак использования характеристик.
//
Функция ПроверитьИспользованиеХарактеристик(Номенклатура, ВладелецХарактеристики) Экспорт

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидНоменклатуры"           , "ВидНоменклатуры");
	СтруктураРеквизитов.Вставить("ИспользованиеХарактеристик", "ВидНоменклатуры.ИспользованиеХарактеристик");
	ЗначенияРеквизитовВИБ = ОбщегоНазначенияРТ.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураРеквизитов);

	Если ЗначенияРеквизитовВИБ.ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать Тогда
		ИспользованиеХарактеристик = Ложь;
	Иначе
		ИспользованиеХарактеристик = Истина;

		Если ЗначенияРеквизитовВИБ.ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ОбщиеДляВидаНоменклатуры Тогда
			ВладелецХарактеристики = ЗначенияРеквизитовВИБ.ВидНоменклатуры;
		Иначе
			ВладелецХарактеристики = Номенклатура;
		КонецЕсли;
	КонецЕсли;

	Возврат ИспользованиеХарактеристик;

КонецФункции

#КонецОбласти
