///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ИнтеграцияСПлатежнымиСистемами".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиПереопределяемый.
//
// Переопределяемые серверные процедуры интеграции с Системой быстрых платежей:
//  - работа с настройками оплат в прикладной конфигурации;
//  - определение параметров оплаты и возврата на основании первичного документа;
//  - обработка статусов выполнения оплат и возвратов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкиИнтеграции

// Позволяет настроить элементы настройки приема оплат на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  НастройкиФормы - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеЭлементы - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Элемент - элемент формы, в котором заполняется наименование;
//    * ЭлементыНастроекОплаты - Структура - элементы формы настройки оплаты. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля.
//    * ЗначенияНастроекОплаты - Структура - текущее значение реквизитов настроек. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля:
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки интеграции с
//    Системой быстрых платежей, которые передаются в методе ИнтеграцияСПлатежнымиСистемамиКлиент.ПодключитьИнтеграциюССБП.
//
Процедура ПриНастройкеЭлементовФормыИнтеграции(НастройкиФормы, ДополнительныеПараметры) Экспорт

	ИнтеграцияСПлатежнымиСистемамиРТСервер.ПриНастройкеЭлементовФормыИнтеграции(НастройкиФормы, ДополнительныеПараметры);
	
КонецПроцедуры

// Позволяет предзаполнить настройки приема платежей на формах подключения
// к Системе быстрых платежей.
//
// Параметры:
//  Настройки - Структура - содержит элементы формы и текущие значения реквизитов:
//    * ОбщиеНастройки - Структура - общие настройки формы подключения к Системой быстрых платежей:
//      ** Наименование - Строка - значение заполнения поля наименование;
//    * НастройкиОплаты - Структура - значение заполнения реквизитов настройки приема оплат. Структура параметра
//        соответствует структуре регистра, который определяется в методе
//        ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции, за исключением
//        полей указанных в настройках в свойстве ИсключаемыеПоля:
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры настройки интеграции с
//    Системой быстрых платежей, которые передаются в методе ИнтеграцияСПлатежнымиСистемамиКлиент.ПодключитьИнтеграциюССБП.
//
Процедура ПриЗаполненииФормыИнтеграции(Настройки, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеОперации

// Определяются данные для формирования запроса на оплату в платежную систему СБП.
// Все поля переменной ЗаказНаОплату обязательны для заполнения.
//
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//                   продажу в информационной базе;
//  ЗаказНаОплату - Структура - содержит описание заказа на оплату в платежной системе СБП:
//    *СуммаОплаты - Число - сумма оплаты в платежной системе. Сумма, которую необходимо
//                   списать со счета или карты покупателя;
//    *ДатаОплаты - Дата - дата операции оплаты;
//    *СрокЖизниQRКода - Число - содержит значение срока действия QR-кода в целых минутах.
//                       Минимальное значение - 5 минут, максимальное значение - 129 600 минут
//                       (90 дней в минутах). В случае передачи значения не входящего в выше
//                       описанный диапазон возвращать ошибку "НеверныйФорматЗапроса".
//                       Если значение не предано используется стандартный срок использования СБП.
//    *НазначениеПлатежа - Строка - информация о платеже, которая будет отображена пользователю
//                         в момент сканирования QR-кода в мобильном приложении. Рекомендуется
//                         делать строку не длинной и включать информацию об организации, которая
//                         является получателем денежных средств, например: Оплата СБП 524,00 RUB ООО Ромашка
//                         Если строка не заполнена, будет передано стандартное представление
//                         назначения: Оплата СБП {ЗаказНаОплату.СуммаОплаты} RUB.
//                         Длина строки не должна превышать 140 символов, в противном случае будет
//                         обрезана принудительно. Система быстрых платежей имеет дополнительные требования
//                         к символам и их кодировке. Возможна передача следующих значений:
//                           - символы латинского алфавит (A-Z и a-z) с десятичными кодами из диапазона
//                             [065-090] и [091-122] в кодировке UTF-8;
//                           - символы русского алфавит (А-Я и а-я) с десятичными кодами из диапазона
//                             [065-090] и [091-122] в кодировке UTF-8;
//                           - цифры (0-9) с десятичными кодами из диапазона [048-057] в кодировке UTF-8;
//                           - специальные символы с десятичными кодами из диапазонов [032-047], [058-064],
//                             [091-096],[123-126] в кодировке UTF-8;
//                           - символ № под номером 8470 в кодировке UTF-8;
//  ТорговаяТочка - СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//                  настройка интеграции с платежной системой;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//                            заказа на оплату переданные при вызове функции
//                            ИнтеграцияСПлатежнымиСистемами.ИдентификаторОплаты.
//
Процедура ПриФормированииЗаказаНаОплатуСБП(
		ДокументОплаты,
		ЗаказНаОплату,
		ТорговаяТочка,
		ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРТСервер.ПриФормированииЗаказаНаОплатуСБП(ДокументОплаты, ЗаказНаОплату, ТорговаяТочка, ДополнительныеПараметры);
	
КонецПроцедуры

// Определяются данные для формирования запроса на возврат в платежную систему СБП.
// Все поля переменной ЗаказНаВозврат обязательны для заполнения.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//                     возврат в информационной базе;
//  ЗаказНаВозврат - Структура - содержит описание заказа на возврат в платежной системе СБП:
//    *СуммаВозврата - Число - сумма возврата в платежной системе. Сумма, которую необходимо
//                     списать со счета или карты покупателя;
//    *ДатаВозврата - Дата - дата операции возврата;
//  ТорговаяТочка - СправочникСсылка.НастройкиИнтеграцииСПлатежнымиСистемами -
//                  настройка интеграции с платежной системой;
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования
//                            заказа на оплату переданные при вызове функции
//                            ИнтеграцияСПлатежнымиСистемами.ВозвратОплаты.
//
Процедура ПриФормированииЗаказаНаВозвратСБП(
		ДокументВозврата,
		ЗаказНаВозврат,
		ТорговаяТочка,
		ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРТСервер.ПриФормированииЗаказаНаВозвратСБП(ДокументВозврата, ЗаказНаВозврат, ТорговаяТочка, ДополнительныеПараметры);
	
КонецПроцедуры

// Определяет алгоритм обработки операции, статус которых был получен регламентным заданием.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииБИП - документ, который отражает
//    операцию в информационной базе;
//  РезультатОбработки - Структура - результат загрузки статуса операции:
//   * СтатусОперации - Строка - текущее состояние операции операции. Для проверки статуса
//     операции, необходимо функции программного интерфейса общего модуля
//     ИнтеграцияСПлатежнымиСистемамиКлиентСервер. Возможные значения:
//        - "Отменена" - по ранее сформированная операция отменена НСПК;
//        - "Выполнена" - участник СБП подтвердил выполнение операции;
//        - "Ошибка" - не удалось выполнить проверку статуса операции из-за ошибки
//           или участник СБП вернул ошибку;
//    * СообщениеОбОшибке - Строка - сообщение пользователю. Заполняется в случае ошибки.
//  Обработан - Булево - признак обработки операции. Необходимо установить Истина,
//    после завершения обработки.
//
Процедура ПриЗагрузкеСтатусаОперации(
		ДокументОперации,
		РезультатОбработки,
		Обработан) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

// Определяет прикладные настройки интеграции с платежными системами.
//
// Параметры:
//  Настройки - Структура - настройки интеграции:
//    *ОбъектМетаданных - Метаданные.РегистрыСведений - объект метаданных регистр сведений,
//                        в котором хранятся настройки выполнения оплат. Регистр определяет
//                        связь торговой точки платежной системы и аналитики ведения учета
//                        в программах 1С. На основании данных регистра должен выполняется
//                        поиск торговой точки (настройки интеграции) при выполнении оплат и возвратов;
//    *ИсключаемыеПоля - Массив Из Строка - наименования измерений, ресурсов или реквизитов, которые
//                        необходимо скрыть на форме настройки интеграции. 
//
Процедура ПриОпределенииНастроекИнтеграции(Настройки) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРТСервер.ПриОпределенииНастроекИнтеграции(Настройки);
	
КонецПроцедуры

// Определяет алгоритм записи настроек оплат в регистр сведений указанный в методе
// ИнтеграцияСПлатежнымиСистемамиПереопределяемый.ПриОпределенииНастроекИнтеграции.
//
// Параметры:
//  ПараметрыОплаты - Структура - содержит данные для записи настроек в регистр сведений.
//                    Структура параметра соответствует структуре регистра, которая определена
//                    в метаданных за исключением полей указанных в настройках в свойстве ИсключаемыеПоля
//                    процедуры ПриОпределенииНастроекИнтеграции;
//  Отказ - Булево - следует устанавливать значение Истина, если в процессе записи возникли ошибки;
//  СообщениеОбОшибке - Строка - сообщение для пользователя. Отображается в случае, если в параметр
//                      Отказ установлено значение Истина.
//
Процедура ПриЗаписиНастроекИнтеграции(ПараметрыОплаты, Отказ, СообщениеОбОшибке) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРТСервер.ПриЗаписиНастроекИнтеграции(ПараметрыОплаты, Отказ, СообщениеОбОшибке);
	
КонецПроцедуры

#КонецОбласти
