
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеЗаполнения = ПолучитьДанныеЗаполненияНаСервере(ПараметрКоманды);
	Для Каждого СтруктураЗаполнения Из ДанныеЗаполнения Цикл
		
		ОткрытьФорму("Документ.РегистрацияБезналичнойОплаты.Форма.ФормаДокумента", Новый Структура("Основание", СтруктураЗаполнения),,Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаполненияНаСервере(ЗаказПокупателя)
	
	ДанныеЗаполнения = Документы.ЗаказПокупателя.ПодготовитьСтруктурыДляЗаполненияРегистрацииБезналичнойОплаты(ЗаказПокупателя);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции
