#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитов;
	
	Справочники.ХранилищеШаблонов.ЗаполнитьИменаРеквизитовПоТипуШаблона(
		ЭтотОбъект,
		МассивВсехРеквизитов,
		МассивРеквизитов
	);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначенияРТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитов,
		МассивНепроверяемыхРеквизитов
	);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

//{ds-18.02.2021
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда 
		Если Ссылка.ds_Стандартный И Не РольДоступна("ПолныеПрава") Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование стандартных макетов запрещено!");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
//}

#КонецОбласти

#КонецЕсли
