////////////////////////////////////////////////////////////////////////////////
// Модуль "ЦенообразованиеКлиентПереопределяемый", содержит процедуры и функции для 
// обработки действий пользователя в процессе работы с ценами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик команды "Печать ценников" обработки "Применение цен номенклатуры".
//
// Параметры:
//  СтруктураПараметры - Структура - структура параметров выполнения операции.
//
Процедура ПечатьЦенниковПрименениеЦенНоменклатуры(СтруктураПараметры) Экспорт
	
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",
		СтруктураПараметры,           
		,                             
		Новый УникальныйИдентификатор);

КонецПроцедуры	
	
// Обработчик команды "Печать этикеток" обработки "Применение цен номенклатуры".
//
// Параметры:
//  СтруктураПараметры - Структура - структура параметров выполнения операции.
//
Процедура ПечатьЭтикетокПрименениеЦенНоменклатуры(СтруктураПараметры) Экспорт
	
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",
		СтруктураПараметры,           
		,                             
		Новый УникальныйИдентификатор);
	
КонецПроцедуры	

#КонецОбласти
