#Область СлужебныйПрограммныйИнтерфейс

#Область Локализация

// Переопределение параметров интеграции ГИСМ (расположения форматированной строки)
//
// Параметры:
//   Форма            - ФормаКлиентскогоПриложения - прикладная форма для встраивания форматированной строки
//   ПараметрыНадписи - Структура        - (см. СобытияФормИС.ПараметрыИнтеграцииДляДокументаОснования)
Процедура ПриОпределенииПараметровИнтеграцииДляДокументаОснования(Форма, ПараметрыНадписи) Экспорт
	
	СобытияФормГИСМРТ.ПриОпределенииПараметровИнтеграцииДляДокументаОснования(Форма, ПараметрыНадписи);
	
КонецПроцедуры

// Переопределение параметров интеграции ГИСМ (расположения форматированной строки)
//
// Параметры:
//   Форма            - ФормаКлиентскогоПриложения - прикладная форма для встраивания форматированной строки
//   ПараметрыНадписи - Структура        - (см. СобытияФормИС.ПараметрыИнтеграцииДляДокументаОснования)
Процедура ПриОпределенииПараметровИнтеграцииДляОбмена(Форма, ПараметрыНадписи) Экспорт
	
	СобытияФормГИСМРТ.ПриОпределенииПараметровИнтеграцииДляОбмена(Форма, ПараметрыНадписи);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	СобытияФормГИСМРТ.ПослеЗаписиНаСервере(Форма);
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	СобытияФормГИСМРТ.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
КонецПроцедуры


Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	СобытияФормГИСМРТ.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
КонецПроцедуры

// Заполняет требуемый тип надписи в прикладной форме из фиксированного списка:
//   УведомлениеОбОтгрузке
//   УведомлениеОСписании
//   <пустая строка> (надпись не требуется)
// 
// Параметры:
//   Форма      - ФормаКлиентскогоПриложения - форма для размещения надписи
//   ТипНадписи - Строка           - тип надписи связанных документов ГИСМ
Процедура ПриОпределенииТипаНадписиПоФорме(Форма, ТипНадписи) Экспорт
	
	СобытияФормГИСМРТ.ПриОпределенииТипаНадписиПоФорме(Форма, ТипНадписи);
	
КонецПроцедуры

Процедура ПриОпределенииТипаСтатусаОбмена(Форма, ТипНадписи) Экспорт
	
	СобытияФормГИСМРТ.ПриОпределенииТипаСтатусаОбмена(Форма, ТипНадписи);
КонецПроцедуры

#Область СобытияЭлементовФорм

// Серверная переопределяемая процедура, вызываемая из обработчика события элемента.
//
// Параметры:
//   Форма                   - ФормаКлиентскогоПриложения - форма, из которой происходит вызов процедуры.
//   Элемент                 - Строка           - имя элемента-источника события "При изменении"
//   ДополнительныеПараметры - Структура        - значения дополнительных параметров влияющих на обработку.
//
Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры) Экспорт
	
	СобытияФормГИСМРТ.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
