
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
		"Обработка.ПанельАдминистрированияРТ.Форма.НастройкиНоменклатуры",
		Новый Структура("ТекущийЭлементИмя", "КолонкаДляПечатиНоменклатуры"),
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.ПанельАдминистрированияРТ.Форма.НастройкиНоменклатуры" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
