#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Магазин") Тогда
		Магазин = Параметры.Магазин;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("СохранениеНастроек") Тогда
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Параметры.СохранениеНастроек;
	Иначе
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокОсновнойКнопки") Тогда
		Элементы.ФормаСохранитьИЗакрыть.Заголовок = Параметры.ЗаголовокОсновнойКнопки;
	КонецЕсли;
	
	ВариантРаспределенияТоваров = Справочники.ВариантыРаспределенияТоваров.ПриОтгрузкеПоОстаткам;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ НастройкиВарианта, ПрименятьАвтоматически
	|ИЗ РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК Настройки
	|ГДЕ ВариантРаспределенияТоваров = &ВариантРаспределенияТоваров И Магазин = &Магазин";
	Запрос.УстановитьПараметр("ВариантРаспределенияТоваров", ВариантРаспределенияТоваров);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ОткрыватьНастройкиПередРаспределением = НЕ Результат.ПрименятьАвтоматически;
		НастройкиВарианта.Загрузить(Результат.НастройкиВарианта.Получить());
	КонецЕсли;
	
	ИспользованныеСклады = Новый Массив();
	Для Каждого Строка Из НастройкиВарианта Цикл
		ИспользованныеСклады.Добавить(Строка.Склад);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Магазин = &Магазин
	|	И НЕ Склады.Ссылка В (&ИспользованныеСклады)
	|	И НЕ Склады.ПометкаУдаления";
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ИспользованныеСклады", ИспользованныеСклады);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		НовСтр = НастройкиВарианта.Добавить();
		НовСтр.Склад = Результат.Склад;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Закрыть(СтруктураВозвратаФормы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтруктураВозвратаФормы()
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("НастройкиВарианта", Новый ХранилищеЗначения(НастройкиВарианта.Выгрузить()));
	СтруктураРезультат.Вставить("ПрименятьАвтоматически", НЕ ОткрыватьНастройкиПередРаспределением);
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти