#Область ПрограммныйИнтерфейс

Функция ПроверитьНаличиеДоговораЯндексКассы(Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиЯндексКассы.СДоговором КАК СДоговором
	|ИЗ
	|	Справочник.НастройкиЯндексКассы КАК НастройкиЯндексКассы
	|ГДЕ
	|	НастройкиЯндексКассы.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	НаличиеДоговора = ВыборкаИзРезультатаЗапроса.СДоговором;
	
	Возврат НаличиеДоговора;
	
КонецФункции

#КонецОбласти
