////////////////////////////////////////////////////////////////////////////////
// ДокументыФизическихЛицКлиентСервер. Содержит вспомогательные процедуры 
//  обработки документов физических лиц.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает структуру документа удостоверяющего личность.
//
// Параметры:
//  Физлицо - СправочникСсылка.ФизическиеЛица - физическое лицо по которому возвращается документ удостовряющий личность.
//  Дата - Дата - дата на которую проверяется документ.
//
// Возвращаемое значение:
//  Структура - структура документа удостоверяющего личность.
//
Функция СтруктураДокументаУдостоверяющегоЛичность(Физлицо, Дата = Неопределено) Экспорт
	
	Возврат ДокументыФизическихЛиц.СтруктураДокументаУдостоверяющегоЛичность(Физлицо, Дата);
	
КонецФункции


#КонецОбласти

