
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда 
		Объект.Магазин = ПараметрыСеанса.ТекущийМагазин;
		Объект.ВидОперации = Перечисления.ds_ВидыОперацийУстановкаКатегорийНоменклатуры.Установка;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	
	ВидимостьРеквизитов = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ds_ВидыОперацийУстановкаКатегорийНоменклатуры.Установка");
	
	Элементы.Категория.Видимость = ВидимостьРеквизитов;
	Элементы.ДатаОкончания.Видимость = ВидимостьРеквизитов;
	Элементы.ТоварыЦена.Видимость = ВидимостьРеквизитов;
	
КонецПроцедуры

#КонецОбласти

