// Процедура заполняет документ или обработку по остаткам заказа.
// Отличние от штатной - эта умеет принимат массив заказов
Процедура ЗаполнитьПоОстаткамЗаказа(Объект, ЗаказПокупателя) Экспорт
	
	Если ТипЗнч(ЗаказПокупателя) <> Тип("Массив") Тогда
		МассивЗаказов = новый Массив();
		МассивЗаказов.Добавить(ЗаказПокупателя);
	Иначе
		МассивЗаказов = ЗаказПокупателя;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.КодСтроки КАК КодСтроки,
	|	СУММА(ВложенныйЗапрос.ЗаказаноОстаток) КАК ЗаказаноОстаток,
	|	ВложенныйЗапрос.Заказ
	|ПОМЕСТИТЬ ТаблицаРегистра
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыПокупателейОстатки.Характеристика КАК Характеристика,
	|		ЗаказыПокупателейОстатки.КодСтроки КАК КодСтроки,
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|		ЗаказыПокупателейОстатки.Заказ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ В (&Заказ)) КАК ЗаказыПокупателейОстатки
	|	ГДЕ
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток > 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗаказыПокупателей.Номенклатура,
	|		ЗаказыПокупателей.Характеристика,
	|		ЗаказыПокупателей.КодСтроки,
	|		ЗаказыПокупателей.Заказано,
	|		ЗаказыПокупателей.Заказ
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|	ГДЕ
	|		ЗаказыПокупателей.Регистратор = &Регистратор
	|		И ЗаказыПокупателей.Заказ В (&Заказ)) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.КодСтроки,
	|	ВложенныйЗапрос.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Характеристика КАК Характеристика,
	|	ЗаказПокупателяТовары.Количество КАК Количество,
	|	ЗаказПокупателяТовары.Упаковка КАК Упаковка,
	|	ЗаказПокупателяТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказПокупателяТовары.Цена КАК Цена,
	|	ЗаказПокупателяТовары.Продавец КАК Продавец,
	|	ЗаказПокупателяТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ЗаказПокупателяТовары.Сумма КАК Сумма,
	|	ЗаказПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ЗаказПокупателяТовары.КлючСвязи КАК КлючСвязи,
	|	ЗаказПокупателяТовары.КодСтроки КАК КодСтроки,
	|	ЗаказПокупателяТовары.Резервировать КАК Резервировать,
	|	ЗаказПокупателяТовары.ПродажаПодарка КАК ПродажаПодарка,
	|	ЗаказПокупателяТовары.КлючСвязиУслугаАгента КАК КлючСвязиУслугаАгента,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателяТовары.Номенклатура.ДоговорКонтрагента
	|		ИНАЧЕ ЗаказПокупателяТовары.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	ЗаказПокупателяТовары.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В (&Заказ)
	|	И ЗаказПокупателяТовары.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.Упаковка КАК Упаковка,
	|	ТаблицаДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаДокумента.Цена КАК Цена,
	|	ТаблицаДокумента.Продавец КАК Продавец,
	|	ТаблицаДокумента.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТаблицаДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ТаблицаДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТаблицаДокумента.КлючСвязи КАК КлючСвязи,
	|	ТаблицаДокумента.КодСтроки КАК КодСтроки,
	|	ТаблицаДокумента.ПродажаПодарка КАК ПродажаПодарка,
	|	ТаблицаРегистра.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	ТаблицаДокумента.Резервировать КАК Резервировать,
	|	ТаблицаДокумента.КлючСвязиУслугаАгента КАК КлючСвязиУслугаАгента,
	|	ТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаРегистра.Заказ
	|ПОМЕСТИТЬ ТаблицаДокументРегистр
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРегистра КАК ТаблицаРегистра
	|		ПО ТаблицаДокумента.Номенклатура = ТаблицаРегистра.Номенклатура
	|		И ТаблицаДокумента.Характеристика = ТаблицаРегистра.Характеристика
	|		И ТаблицаДокумента.КодСтроки = ТаблицаРегистра.КодСтроки
	|		И ТаблицаДокумента.Заказ = ТаблицаРегистра.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументРегистр.Номенклатура КАК Номенклатура,
	|	ТаблицаДокументРегистр.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА ТаблицаДокументРегистр.Упаковка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА ТаблицаДокументРегистр.КоличествоУпаковок
	|		ИНАЧЕ ТаблицаДокументРегистр.ЗаказаноОстаток
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ТаблицаДокументРегистр.Цена КАК Цена,
	|	ТаблицаДокументРегистр.Продавец КАК Продавец,
	|	ТаблицаДокументРегистр.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ТаблицаДокументРегистр.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТаблицаДокументРегистр.Сумма * ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаДокументРегистр.ЗаказаноОстаток / ТаблицаДокументРегистр.Количество
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаДокументРегистр.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокументРегистр.СуммаНДС * ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаДокументРегистр.ЗаказаноОстаток / ТаблицаДокументРегистр.Количество
	|	КОНЕЦ КАК СуммаНДС,
	|	ТаблицаДокументРегистр.СуммаАвтоматическойСкидки * ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаДокументРегистр.ЗаказаноОстаток / ТаблицаДокументРегистр.Количество
	|	КОНЕЦ КАК СуммаАвтоматическойСкидки,
	|	ТаблицаДокументРегистр.СуммаРучнойСкидки * ВЫБОР
	|		КОГДА ТаблицаДокументРегистр.Количество = ТаблицаДокументРегистр.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаДокументРегистр.ЗаказаноОстаток / ТаблицаДокументРегистр.Количество
	|	КОНЕЦ КАК СуммаРучнойСкидки,
	|	ТаблицаДокументРегистр.КлючСвязи КАК КлючСвязи,
	|	ТаблицаДокументРегистр.КодСтроки КАК КодСтроки,
	|	ТаблицаДокументРегистр.ЗаказаноОстаток КАК Количество,
	|	ТаблицаДокументРегистр.Заказ КАК ЗаказПокупателя,
	|	&Склад КАК Склад,
	|	ТаблицаДокументРегистр.ПродажаПодарка КАК ПродажаПодарка,
	|	ТаблицаДокументРегистр.Резервировать КАК Резервировать,
	|	СпрНоменклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция) КАК
	|		ТабачнаяПродукция,
	|	ТаблицаДокументРегистр.КлючСвязиУслугаАгента КАК КлючСвязиУслугаАгента,
	|	ТаблицаДокументРегистр.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	ТаблицаДокументРегистр КАК ТаблицаДокументРегистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТаблицаДокументРегистр.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ТаблицаДокументРегистр.ЗаказаноОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументРегистр.КлючСвязи КАК КлючСвязи,
	|	ТаблицаДокументРегистр.Количество КАК Количество,
	|	ТаблицаДокументРегистр.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	ТаблицаДокументРегистр.Заказ
	|ПОМЕСТИТЬ ТаблицаСкидокПоТоварам
	|ИЗ
	|	ТаблицаДокументРегистр КАК ТаблицаДокументРегистр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяСкидкиНаценки.КлючСвязи КАК КлючСвязи,
	|	ЗаказПокупателяСкидкиНаценки.Сумма КАК Сумма,
	|	ЗаказПокупателяСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	ЗаказПокупателяСкидкиНаценки.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ТаблицаДокументаСкидки
	|ИЗ
	|	Документ.ЗаказПокупателя.СкидкиНаценки КАК ЗаказПокупателяСкидкиНаценки
	|ГДЕ
	|	ЗаказПокупателяСкидкиНаценки.Ссылка В (&Заказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументаСкидки.КлючСвязи КАК КлючСвязи,
	|	ТаблицаДокументаСкидки.Сумма * ВЫБОР
	|		КОГДА ТаблицаСкидокПоТоварам.Количество = ТаблицаСкидокПоТоварам.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаСкидокПоТоварам.ЗаказаноОстаток / ТаблицаСкидокПоТоварам.Количество
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаДокументаСкидки.СкидкаНаценка КАК СкидкаНаценка
	|ИЗ
	|	ТаблицаСкидокПоТоварам КАК ТаблицаСкидокПоТоварам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументаСкидки КАК ТаблицаДокументаСкидки
	|		ПО ТаблицаСкидокПоТоварам.КлючСвязи = ТаблицаДокументаСкидки.КлючСвязи
	|		И ТаблицаСкидокПоТоварам.Заказ = ТаблицаДокументаСкидки.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЧекККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Проведен
	|	И ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
	|	И ЧекККМ.ЗаказПокупателя В (&Заказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяПодарки.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяПодарки.СкидкаНаценка КАК СкидкаНаценка,
	|	ЗаказПокупателяПодарки.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяПодарки.Характеристика КАК Характеристика,
	|	ЗаказПокупателяПодарки.Количество КАК Количество,
	|	ЗаказПокупателяПодарки.Цена КАК Цена,
	|	ЗаказПокупателяПодарки.Сумма КАК Сумма,
	|	ЗаказПокупателяПодарки.Склад КАК Склад,
	|	ЗаказПокупателяПодарки.КлючСвязи КАК КлючСвязи,
	|	ЗаказПокупателяПодарки.Упаковка КАК Упаковка,
	|	ЗаказПокупателяПодарки.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ЗаказПокупателя.Подарки КАК ЗаказПокупателяПодарки
	|ГДЕ
	|	ЗаказПокупателяПодарки.Ссылка В (&Заказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументаСкидки.СкидкаНаценка КАК СкидкаНаценка
	|ИЗ
	|	ТаблицаДокументаСкидки КАК ТаблицаДокументаСкидки
	|ГДЕ
	|	ТаблицаДокументаСкидки.СкидкаНаценка.Управляемая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеБаллыКНачислению.КлючСвязи КАК КлючСвязи,
	|	БонусныеБаллыКНачислению.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	БонусныеБаллыКНачислению.СкидкаНаценка КАК СкидкаНаценка,
	|	БонусныеБаллыКНачислению.ДатаНачисления КАК ДатаНачисления,
	|	БонусныеБаллыКНачислению.ДатаСписания КАК ДатаСписания,
	|	БонусныеБаллыКНачислению.КоличествоБонусныхБаллов КАК КоличествоБонусныхБаллов,
	|	БонусныеБаллыКНачислению.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ТаблицаДокументаБонусы
	|ИЗ
	|	Документ.ЗаказПокупателя.БонусныеБаллыКНачислению КАК БонусныеБаллыКНачислению
	|ГДЕ
	|	БонусныеБаллыКНачислению.Ссылка В (&Заказ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументаБонусы.КлючСвязи КАК КлючСвязи,
	|	ТаблицаДокументаБонусы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	ТаблицаДокументаБонусы.СкидкаНаценка КАК СкидкаНаценка,
	|	ТаблицаДокументаБонусы.ДатаНачисления КАК ДатаНачисления,
	|	ТаблицаДокументаБонусы.ДатаСписания КАК ДатаСписания,
	|	ТаблицаДокументаБонусы.КоличествоБонусныхБаллов * ВЫБОР
	|		КОГДА ТаблицаСкидокПоТоварам.Количество = ТаблицаСкидокПоТоварам.ЗаказаноОстаток
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаСкидокПоТоварам.ЗаказаноОстаток / ТаблицаСкидокПоТоварам.Количество
	|	КОНЕЦ КАК КоличествоБонусныхБаллов
	|ИЗ
	|	ТаблицаСкидокПоТоварам КАК ТаблицаСкидокПоТоварам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокументаБонусы КАК ТаблицаДокументаБонусы
	|		ПО ТаблицаСкидокПоТоварам.КлючСвязи = ТаблицаДокументаБонусы.КлючСвязи
	|		И ТаблицаСкидокПоТоварам.Заказ = ТаблицаДокументаБонусы.Заказ";
	
	Запрос.УстановитьПараметр("Заказ",       МассивЗаказов);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Склад",       МассивЗаказов[0].Склад);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаТоваров = Результат[3].Выгрузить();
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваров") Тогда 
		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл 
			
			Если СтрокаТаблицы.ТабачнаяПродукция Тогда 
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), СтрокаТаблицы);
			
		КонецЦикла;
	Иначе 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаТоваров, Объект["Товары"]);
	КонецЕсли;
	
	ТаблицаСкидок = Результат[6].Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаСкидок, Объект["СкидкиНаценки"]);
	
	МетаданныеДокумента = Объект.Ссылка.Метаданные();
	
	Если Результат[7].Пустой() 
		И ОбщегоНазначенияРТ.ЕстьТЧОбъекта("Подарки", МетаданныеДокумента) Тогда
		ТаблицаПодарков = Результат[8].Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПодарков, Объект["Подарки"]);
	КонецЕсли;
	
	Если ОбщегоНазначенияРТ.ЕстьТЧОбъекта("УправляемыеСкидки", МетаданныеДокумента) Тогда
		ТаблицаУправляемыеСкидки = Результат[9].Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаУправляемыеСкидки, Объект["УправляемыеСкидки"]);
	КонецЕсли;
	
	Если ОбщегоНазначенияРТ.ЕстьТЧОбъекта("БонусныеБаллыКНачислению", МетаданныеДокумента) Тогда
		ТаблицаБонусов = Результат[11].Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаБонусов, Объект["БонусныеБаллыКНачислению"]);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьПоОстаткуЗаказа()
