// Возвращает данные классификатора валют.
// Подлежит замене после реализации в БСП интерфейсного метода.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - имеет колонки:
//    * КодВалютыЦифровой - цифровой код по классификатору.
//    * КодВалютыБуквенный - буквенный код по классификатору.
//    * Наименование - наименование по классификатору.
//
Функция ДанныеКлассификатораВалют() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеКлассификатора = Новый ТаблицаЗначений;
	ДанныеКлассификатора.Колонки.Добавить("КодВалютыЦифровой");
	ДанныеКлассификатора.Колонки.Добавить("КодВалютыБуквенный");
	ДанныеКлассификатора.Колонки.Добавить("Наименование");
	
	НоваяСтрока = ДанныеКлассификатора.Добавить();
	НоваяСтрока.КодВалютыЦифровой = "643";
	НоваяСтрока.КодВалютыБуквенный = "RUB";
	НоваяСтрока.Наименование = "Российский рубль";
	
	Возврат ДанныеКлассификатора;

КонецФункции
