#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ds_ДенежныеЗнаки.Ссылка КАК ДенежныйЗнак,
		|	ds_ДенежныеЗнаки.Вид
		|ИЗ
		|	Справочник.ds_ДенежныеЗнаки КАК ds_ДенежныеЗнаки
		|ГДЕ
		|	ds_ДенежныеЗнаки.Использовать
		|
		|УПОРЯДОЧИТЬ ПО
		|	ds_ДенежныеЗнаки.Номинал";
		ЭтотОбъект.ДенежныеСредства.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ds_ОбщегоНазначенияВызовСервера.РольДоступнаТекущемуПользователю("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ОбщегоНазначенияРТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ДенежныйЗнак, "Номинал");
	Объект.Сумма = Объект.ДенежныеСредства.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

#КонецОбласти
