#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область СлужебныЙПрограммныйИнтерфейс

// Свойства сервера МЧД.
// 
// Возвращаемое значение:
//  СтруктураАдреса - Структура:
//  * АдресСервера - Строка -
//  * АдресСервераБезАутентификации - Строка -
//  * РесурсКорняAPI - Строка -
//  * ЛогинОператора - Строка -
//  * ПарольОператора - Строка -
//  * ИспользоватьРасширенияAPI - Булево -
// 
Функция СвойстваСервераМЧД() Экспорт
	
	СтруктураАдреса = Константы.АдресСервераМЧД.ПрочитатьАдрес();
	СтруктураАдреса.Вставить("АдресСервераБезАутентификации",	СтруктураАдреса.АдресСервера);
	СтруктураАдреса.Вставить("ЛогинОператора", 					"");
	СтруктураАдреса.Вставить("ПарольОператора", 				"");
	
	Возврат СтруктураАдреса;
	
КонецФункции

// Используется режим тестирования.
// 
// Возвращаемое значение:
//  Булево
//  
Функция ИспользуетсяРежимТестирования() Экспорт
	
	Возврат Константы.РежимТестированияМЧД.Получить();
	
КонецФункции

Функция EF_00_00448079_ЕстьДоступКВебСервису1CЭДО() Экспорт
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("Успех", Ложь);
	РезультатПроверки.Вставить("Ошибка", Неопределено);
	
	ОписаниеСоединения = СервисЭДОПовтИсп.СоединениеССервисом(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО, 7);
	
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = СервисЭДО.EF_00_00448079_АдресРесурсаPing();
	HTTPЗапрос.Заголовки.Вставить("Integrator-Id", СервисЭДО.EF_00_00448079_ИдентификаторИнтеграционногоРешения());
	
	ПредставлениеОперации = НСтр("ru = 'Проверка доступа к сервису 1С-ЭДО'");
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	РезультатВыполненияЗапроса = ИнтернетСоединениеБЭД.ВызватьHTTPМетод(ОписаниеСоединения, HTTPЗапрос,
		ИнтернетСоединениеБЭД.HTTPМетоды().GET, ПредставлениеОперации, КонтекстДиагностики);
	
	РезультатПроверки.Успех = РезультатВыполненияЗапроса.Успех;
	
	Если ЗначениеЗаполнено(КонтекстДиагностики.Диагностика.Ошибки) Тогда
		РезультатПроверки.Ошибка = КонтекстДиагностики.Диагностика.Ошибки[0];
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти
