
#Область ПрограммныйИнтерфейс

Функция АдресДанныхПроверкиАлкогольнойПродукции(ПараметрыСканирования, Знач Объект, УникальныйИдентификатор) Экспорт
	
	Возврат ПроверкаИПодборПродукцииЕГАИСРТ.АдресДанныхПроверкиАлкогольнойПродукции(ПараметрыСканирования, Объект, УникальныйИдентификатор);
	
КонецФункции

//Процедура ПриЗакрытииФормыПроверкиИПодбораВФормеРМК(Форма, Результат) Экспорт
//	
//	РезультатПроверки = ПолучитьИзВременногоХранилища(Результат);
//	ДеревоМаркируемойПродукции = РезультатПроверки.ДеревоМаркируемойПродукции;
//	
//	ИнтеграцияИСРТ.УдалитьСтрокиАкцизныхМарокПоВидуПродукции(Форма.Объект.АкцизныеМарки, Перечисления.ВидыПродукцииИС.Алкогольная);
//	
//	ПараметрыЗаполнения = АкцизныеМаркиЕГАИС.ПараметрыЗаполненияТоваровИАкцизныхМарок(Форма, Ложь);
//	ПараметрыЗаполнения.ЕстьКоличествоАкцизныхМарок    = Истина;
//	ПараметрыЗаполнения.ЕстьСправка2                   = Ложь;
//	ПараметрыЗаполнения.ПараметрыУказанияСерий         = Форма.ПараметрыУказанияСерий;
//	ПараметрыЗаполнения.ИмяКолонкиАлкогольнаяПродукция = "НоменклатураЕГАИС";
//	
//	АкцизныеМаркиЕГАИСРТ.ЗаполнитьТоварыИАкцизныеМарки(Форма.Объект, ДеревоМаркируемойПродукции, ПараметрыЗаполнения);
//	ОбработкаТабличнойЧастиТоварыСервер.ЗаполнитьМаркируемаяПродукцияГосИС(Форма.Объект.Товары);
//	
//	Форма.ОбработатьСтрокиТЧ(
//		ПараметрыЗаполнения.ДобавленныеСтроки,
//		ПараметрыЗаполнения.ИзмененныеСтроки);
//		
//	Настройки = ПроверкаИПодборПродукцииИС.НастройкиИсточникаКешаШтрихкодовУпаковок();
//	НастройкиИсточникаКэша = ПроверкаИПодборПродукцииИСМПРТ.НастройкиИсточникаКешаЧека();
//	ЗаполнитьЗначенияСвойств(Настройки, НастройкиИсточникаКэша);
//		
//	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, Настройки);
//	ПроверкаИПодборПродукцииИС.ПрименитьКешШтрихкодовУпаковок(Форма, Настройки);
//	ШтрихкодированиеИС.ОбновитьКэшМаркируемойПродукции(Форма);
//	
//КонецПроцедуры

#КонецОбласти

