#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	КомпоновщикНастроекФормы = Форма.Отчет.КомпоновщикНастроек;
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды")
			И Параметры.Свойство("ОписаниеКоманды")
			И Параметры.ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда 
			
			Параметры.КлючВарианта = "АнализРасхождений";
			Форма.ФормаПараметры.Отбор.Вставить("ПоступлениеТоваров", Параметры.ПараметрКоманды);
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПолеПоступлениеТоваров = Новый ПолеКомпоновкиДанных("ПоступлениеТоваров");
	
	ПараметрПоступлениеТоваров = КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(ПолеПоступлениеТоваров);
	
	Если ПараметрПоступлениеТоваров <> Неопределено И ЗначениеЗаполнено(ПараметрПоступлениеТоваров.Значение) Тогда
		ОбщегоНазначенияРТ.ВывестиОснованиеОтчета(ДокументРезультат, ПараметрПоступлениеТоваров.Значение);
	Иначе
		ОбщегоНазначенияРТ.ВывестиДатуФормированияОтчета(ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
