
#Область ПрограммныйИнтерфейс

Процедура РазвернутьДерево(СтрокаДерева, ЭлементФормы, СПодчиненными = Истина) Экспорт
	
	КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
	Для каждого Элемент Из КоллекцияЭлементов Цикл
		ЭлементФормы.Развернуть(Элемент.ПолучитьИдентификатор(), СПодчиненными);
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьДерево(СтрокаДерева, ЭлементФормы) Экспорт
	
	КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
	Для каждого Элемент Из КоллекцияЭлементов Цикл
		ЭлементФормы.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьФлажкиДерева(СтрокаДерева, Отметка) Экспорт 
	
	КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
	Для каждого Элемент Из КоллекцияЭлементов Цикл
		Элемент.Отметка = Отметка;
		ПроставитьОтметкуЭлементамДерева(Элемент, Отметка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроставитьОтметкуЭлементамДерева(СтрокаДерева, Отметка) Экспорт 
	
    СтрокаДерева.Отметка = Отметка;
    СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
    Для Каждого ТекСтрока Из СтрокиДерева Цикл
        Если ТекСтрока.Отметка <> Отметка Тогда
            ПроставитьОтметкуЭлементамДерева(ТекСтрока, Отметка);
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьФлажкиТаблицы(Таблица, Отметка) Экспорт 
	
	Для каждого Элемент Из Таблица Цикл
		Элемент.Отметка = Отметка;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстБуфераОбмена() Экспорт 

	Объект = Новый COMОбъект("htmlfile"); 

	Возврат Объект.ParentWindow.ClipboardData.Getdata("Text"); 

КонецФункции 

Функция УстановитьТекстВБуферОбмена(Текст) Экспорт 

	Объект = Новый COMОбъект("htmlfile"); 
	
	Объект.ParentWindow.ClipboardData.Setdata("Text", Текст); 
	
	Возврат Текст; 

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
