
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ds_РезультатыОбменаДаннымиСОфисом.СообщениеОбмена КАК СообщениеОбмена
	|ИЗ
	|	РегистрСведений.ds_РезультатыОбменаДаннымиСОфисом КАК ds_РезультатыОбменаДаннымиСОфисом
	|ГДЕ
	|	ds_РезультатыОбменаДаннымиСОфисом.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ds_РезультатыОбменаДаннымиСОфисом.ОбъектМетаданных = &ОбъектМетаданных
	|	И ds_РезультатыОбменаДаннымиСОфисом.СсылкаНаОбъект = &СсылкаНаОбъект"; 
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Запись.УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ОбъектМетаданных", Запись.ОбъектМетаданных);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Запись.СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
	    СообщениеОбмена = Выборка.СообщениеОбмена.Получить();

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ЗначениеИзСтрокиВнутр(СообщениеОбмена));
		ТекстСообщенияОбмена = ЗаписьJSON.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
