
#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКЗаполнениюБСО(Параметры) Экспорт
	
	#Если НЕ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДенежныеСредстваБезналичные.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
		|ГДЕ
		|	ДенежныеСредстваБезналичные.БанковскийСчет ССЫЛКА Справочник.УдалитьБанковскиеСчетаОрганизаций";
		
		МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти