
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем АдресТаблицы;
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресТаблицы", АдресТаблицы) Тогда
		
		Таблица.Загрузить(ПолучитьИзВременногоХранилища(АдресТаблицы));
		УдалитьИзВременногоХранилища(АдресТаблицы);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаФормыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ЗакрытьИПередатьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборСтроки(Команда)
	
	ЗакрытьИПередатьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьИПередатьДанные()

	ТекущаяСтрока = Элементы.ТаблицаФормы.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено  Тогда
		Закрыть(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти