#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	ОбработатьПолученныеДанные(Штрихкод, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторЧекаВПлатежнойСистеме") Тогда
		ИдентификаторЧекаВПлатежнойСистеме = Параметры.ИдентификаторЧекаВПлатежнойСистеме;
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.ИдентификаторЧекаВПлатежнойСистеме;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	ПоддерживаемыеТипыОборудования = "СканерШтрихкода,";
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, ПоддерживаемыеТипыОборудования);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудованияРМК(ЭтотОбъект, Источник, Событие, Данные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиПоКоду(Команда)
	ЗакрытьСПередачейРезультата();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата()
	
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("ИдентификаторЧекаВПлатежнойСистеме", ИдентификаторЧекаВПлатежнойСистеме);
	
	Закрыть(СтруктураОтвета)
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДанные(Знач Данные)
	
	Данные = СтрЗаменить(Данные, " ", "");
	Данные = СтрЗаменить(Данные, ";", "@");
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолученныеДанные(Данные, ДополнительныеПараметры)
	Если НЕ ПустаяСтрока(Данные) Тогда
		
		// Подготовка штрихкода
		Данные = ПодготовитьДанные(Данные);
		
		ИдентификаторЧекаВПлатежнойСистеме = Данные;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти