
#Область СлужебныеПроцедурыИФункции

// Возвращает необходимость проверки напоминания создания документов ЕГАИС
Функция ПроверятьНеобходимостьСозданияДокументовЕГАИС() Экспорт
	
	Возврат ИнтеграцияЕГАИСРТВызовСервера.ПроверятьНеобходимостьСозданияДокументовЕГАИС();
	
КонецФункции

Функция ВидыАлкогольнойПродукции(ВидПродукции) Экспорт
	
	Возврат ИнтеграцияЕГАИСРТВызовСервера.ВидыАлкогольнойПродукции(ВидПродукции);
	
КонецФункции

Функция ИспользоватьЕдиныйШтриховойКодДляККТИЕГАИС() Экспорт
	
	Возврат ОбщегоНазначенияРТВызовСервера.ЗначениеКонстанты("ИспользоватьЕдиныйШтриховойКодДляККТИЕГАИС");
	
КонецФункции

#КонецОбласти