
#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьОбмен(Данные)
	
	Узел = ПринятьИзменениеПоПлану(Данные);
	
	Возврат ЗарегистрироватьВыгрузку(Узел);
	
КонецФункции

Функция ПринятьИзменениеПоПлану(СтрокаСообщения)
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
	Данные = ПрочитатьJSON(ЧтениеJson);
	
	Отправитель = ПланыОбмена.ds_ОбменДаннымиСТСД.НайтиПоКоду(Данные.From);
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, Данные.ReceivedNo);
	
	Для Каждого Стр Из Данные.ReceiptOrders Цикл 
		ЗагрузитьАктПриемкиТоваров(Стр);	
	КонецЦикла;	
	
	Узел = Отправитель.ПолучитьОбъект();
	Узел.НомерПринятого = Число(Данные.MessageNo);
	Узел.Записать();

	Возврат Отправитель; 
	
КонецФункции

Процедура ЗагрузитьАктПриемкиТоваров(Элемент)
	

	
КонецПроцедуры

Функция ЗарегистрироватьВыгрузку(Узел)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, Узел.НомерОтправленного + 1);
	
	Данные = Новый Структура;
	Данные.Вставить("From", ПланыОбмена.ds_ОбменДаннымиСТСД.ЭтотУзел().Код);
	Данные.Вставить("ReceivedNo", Узел.НомерПринятого);
	Данные.Вставить("MessageNo", Узел.НомерОтправленного + 1);
	Данные.Вставить("Goods", Новый Массив);
	//Данные.Вставить("Groups", Новый Массив);
	Данные.Вставить("Warehouses", Новый Массив);
	Данные.Вставить("ReceiptOrders", Новый Массив);
		
	Пока ВыборкаИзменений.Следующий() Цикл
	    ОбъектОбмена = ВыборкаИзменений.Получить();
	    ТипДанных = ТипЗнч(ОбъектОбмена);
		
		Если ТипДанных = Тип("СправочникОбъект.Номенклатура") Тогда
			Если ОбъектОбмена.ЭтоГруппа Тогда 
				//Данные.Groups.Добавить(ВыгрузитьГруппаНоменклатуры(ОбъектОбмена.Ссылка));
			Иначе	
				Данные.Goods.Добавить(ВыгрузитьНоменклатура(ОбъектОбмена.Ссылка));
			КонецЕсли;
		ИначеЕсли ТипДанных = Тип("СправочникОбъект.Склады") Тогда 
			Данные.Warehouses.Добавить(ВыгрузитьСклад(ОбъектОбмена.Ссылка));
		ИначеЕсли ТипДанных = Тип("ДокументОбъект.ds_АктПриемкиТоваров") Тогда 
			Данные.ReceiptOrders.Добавить(ВыгрузитьАктПриемкиТоваров(ОбъектОбмена.Ссылка));
		ИначеЕсли ТипДанных = Тип("РегистрСведенийНаборЗаписей.Штрихкоды") Тогда 
			Данные.Barcodes.Добавить(ВыгрузитьШтрихкоды(ОбъектОбмена));
		КонецЕсли;	
	КонецЦикла;
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.НомерОтправленного = Данные.MessageNo;
	УзелОбъект.Записать();

	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ВыгрузитьГруппаНоменклатуры(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Code,
	|	Номенклатура.Наименование КАК Name,
	|	Номенклатура.ds_УИД КАК UID,
	|	Номенклатура.ds_GUID КАК GUID,
	|	ЕСТЬNULL(Номенклатура.Родитель.ds_GUID, """") КАК Parent_GUID,
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка
	|	И Номенклатура.ds_GUID <> """"
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,UID,GUID,Parent_GUID,Level",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),Выборка.UID,Выборка.GUID,Выборка.Parent_GUID,Выборка.Ссылка.Уровень());
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьНоменклатура(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Code,
	|	Номенклатура.Артикул КАК VendorCode,
	|	Номенклатура.Наименование КАК Name,
	|	Номенклатура.УИД КАК UID,
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,VendorCode,UID,GUID",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),СокрЛП(Выборка.VendorCode),Выборка.UID,XMLСтрока(Выборка.Ссылка));
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьСклад(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Код КАК Code,
	|	Склады.Наименование КАК Name,
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,GUID",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьАктПриемкиТоваров(Ссылка)
	

	
КонецФункции	

Функция ВыгрузитьШтрихкоды(НаборЗаписей)
	

	
КонецФункции	

#КонецОбласти
