#Область ПрограммныйИнтерфейс

// Заполняет структуру префиксов номенклатуры.
//
// Параметры:
//  СтруктураПрефиксов          - Структура - с ключами:
//   * НоменклатураВесовой      - Строка - префикс весового товара.
//   * НоменклатураФасованный   - Строка - префикс фасованного товара.
//   * НоменклатураШтучный      - Строка - префикс штучного товара.
//   * СерийныйНомерСертификата - Строка - префикс подарочного сертификата.
//
Процедура ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьПрефиксыШтрихкодовНоменклатуры(СтруктураПрефиксов);
	
КонецПроцедуры

// Возвращает таблицу шаблонов штрихкодов регистрации новых карт.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ДополнительноеОписание - Строка - наименование шаблона.
//   * НачалоДиапазона        - Строка
//   * КонецДиапазона         - Строка
//   * ДлинаШтрихкода         - Число
//
Функция ШаблоныРегистрацииНовыхКарт() Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ШаблоныРегистрацииНовыхКарт();
	
КонецФункции

#Область ТекстыЗапросовШтрихкодов

// Формирует текст запроса штрихкодов по основному регистру.
// Поля запроса: Штрихкод, Владелец, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление, в запросе определяется по типу значения владельца штрихкода.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаШтрихкоды(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса серий номенклатуры.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: Номер, Ссылка, Null, Null, 1, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаСерии(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса кодов SKU.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: SKU, Номенклатура, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаКодыSKU(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса штрихкодов упаковок товаров.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: ЗначениеШтрихкода, Ссылка, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Неопределено.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаШтрихкодыУпаковокТоваров(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса номенклатуры по реквизиту КодВидаНоменклатурнойКлассификации.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: ЗначениеШтрихкода, Ссылка, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - НоменклатураСИЗ.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаНоменклатурнойКлассификации(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса шаблонов регистрации новых карт.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &КодКарты, НЕОПРЕДЕЛЕНО, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - Карта.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поика
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаШаблоныРегистрацииКарт(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса по номеру телефона.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &НомерТелефона, Ссылка, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - Телефон.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаПоТелефону(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса по адресу ЭП.
// Текст входит в состав объединения запросов, поэтому псевдонимы полей не нужны.
// Поля запроса: &НомерТелефона, Ссылка, NULL, NULL, NULL, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление - АдресЭП.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка - текст запроса без псевдонимов полей.
//
Функция ТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаПоАдресуЭП(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

// Формирует текст запроса штрихкодов по основному регистру.
// Поля запроса: Штрихкод, Владелец, Характеристика, Упаковка, Количество, ШаблонШтрихкода.
// ШаблонШтрихкода - Перечисление, в запросе определяется по типу значения владельца штрихкода.
//
// Параметры:
//  ФильтрПоискаПоШтрихкоду - Структура - с ключами поиска
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекстЗапросаДополнительныеОбъекты(ФильтрПоискаПоШтрихкоду);
	
КонецФункции

#КонецОбласти

// Возвращает Истина если для вызывающей формы доступен ввод произвольных
// телефонных номеров и адресов ЭП
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, из которой вызвана команда
//
// Возвращаемое значение:
//  Булево
//
Функция ДобавлятьНеизвестнуюКИ(Форма) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ДобавлятьНеизвестнуюКИ(Форма);
	
КонецФункции

// Заполняет дополнительные данные строки выборки.
//
// Параметры:
//  ДополнительныеДанные - Структура - формируемая в этой процедуре для дополнительного анализа строки.
//  Выборка - ВыборкаИзРезультатаЗапроса - выборка запроса, для заполнения дополнительных данных.
//
Процедура ЗаполнитьДополнительныеДанныеОбъектовВыборки(ДополнительныеДанные, Выборка) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьДополнительныеДанныеОбъектовВыборки(ДополнительныеДанные, Выборка);
	
КонецПроцедуры

// Возвращает таблицу остатков по складу
//
// Параметры:
//  ТаблицаНоменклатурыДляОстатков - ТаблицаЗначений - содержит строки для поиска остатков. Колонки:
//   * Номенклатура - ОпределяемыйТип.НоменклатураШтрихкода - номенклатура.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыШтрихкода - характеристика номенклатуры.
//   * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыШтрихкода - упаковки номенклатуры.
//  СкладОстатков - ОпределяемыйТип.СкладОстатков - склад для которого необходимо получить остатки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - содержит строки с остатками по складу. Колонки:
//   * Номенклатура - ОпределяемыйТип.НоменклатураШтрихкода - номенклатура.
//   * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатурыШтрихкода - характеристика номенклатуры.
//   * Упаковка - ОпределяемыйТип.УпаковкаНоменклатурыШтрихкода - упаковки номенклатуры.
//   * Остаток - Число - количество остатка на складе.
//   * Резерв - Число - количество зарезервировано на складе.
//
Функция ОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков, СкладОстатков) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ОстаткиПоСкладу(ТаблицаНоменклатурыДляОстатков, СкладОстатков);
	
КонецФункции

// Возвращает склад по умолчанию.
//
// Возвращаемое значение:
//  ОпределяемыйТип.СкладОстатков.
//
Функция ТекущийСклад() Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ТекущийСклад();
	
КонецФункции

// Возвращает структуру весового товара по штрихкоду.
//
// Параметры:
//  Штрихкод - Строка
//
// Возвращаемое значение:
//  Структура - с ключами:
//   * КодТовара        - Число - код SKU.
//   * КоличествоТовара - Число - количество весового (фасованного) товара.
//
Функция КодИКоличествоВесовогоТовара(Штрихкод) Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.КодИКоличествоВесовогоТовара(Штрихкод);
	
КонецФункции

// Заполняет массив именами справочников в которых необходим поиск по контактной информации.
//
// Параметры:
//  СправочникиСКИ - Массив из имен справочников
//  СУсловиемПоиска - Булево
//
Процедура ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду) Экспорт
	
	РаботаСоШтрихкодамиРТ.ЗаполнитьМассивСправочниковСКИ(СправочникиСКИ, ФильтрПоискаПоШтрихкоду);
	
КонецПроцедуры

// Дополняет строку таблицы формы ФормаВыбораДанныхПоискаПоШтрихкоду
//
// Параметры:
//  НоваяСтрока - ДанныеФормыЭлементДерева - строка дерева формы выбора
//  СтрокаВыбора - Структура - с ключами значений найденного объекта
//
Процедура ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора) Экспорт
	
	РаботаСоШтрихкодамиРТ.ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора);
	
КонецПроцедуры

// Корректирует результаты поиска по штрихкоду перед выводом на форму
//
Процедура СкорректироватьСтруктуруРезультата(
	СтруктураПараметров,
	Штрихкод,
	СтруктураДействий,
	НеизвестныеДанныеПО,
	ВозможнаРегистрацияНовойНоменклатуры) Экспорт
	
	РаботаСоШтрихкодамиРТ.СкорректироватьСтруктуруРезультата(
		СтруктураПараметров,
		Штрихкод,
		СтруктураДействий,
		НеизвестныеДанныеПО,
		ВозможнаРегистрацияНовойНоменклатуры);
	
КонецПроцедуры

// Дополняет запрос поиска по штрихкоду
//
// Параметры:
//  Запрос - Запрос - запрос выборки данных.
//  Форма - УправляемаяФорма - форма в которой будет проиходить сканирование
//  Штрихкод - Строка - полученный штрихкод со сканера.
//
Процедура ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, Штрихкод = "") Экспорт
	
	РаботаСоШтрихкодамиРТ.ДополнитьПараметрыЗапросаПоиска(Запрос, Форма, Штрихкод);
	
КонецПроцедуры

// Возвращает структуру с ключами поиска по умолчанию
//
Функция ФильтрПоискаПоУмолчанию() Экспорт
	
	Возврат РаботаСоШтрихкодамиРТ.ФильтрПоискаПоУмолчанию();
	
КонецФункции

// Формирует структуру с ключами определяющими построение запроса поиска
// устанавливает эту структуру в реквизит формы ФильтрПоискаПоШтрихкоду
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой будет проиходить сканирование
//
Процедура ОпределитьФильтрПоискаШтрихкода(Форма) Экспорт
	
	РаботаСоШтрихкодамиРТ.ОпределитьФильтрПоискаШтрихкода(Форма)
	
КонецПроцедуры

// Обработка полученного штрихкода.
//
// Штрихкод - Строка - полученный штрихкод со сканера.
// Форма - УправляемаяФорма - форма родитель в которой определен обработчик действия "ПолученыШтрихкоды".
//
// Возвращаемое значение:
//  Структура - данные штрихкода.
//
Функция ДанныеПоискаПоШтрихкоду(Штрихкод, Форма) Экспорт
	
	Возврат РаботаСоШтрихкодами.ДанныеПоискаПоШтрихкоду(Штрихкод, Форма);
	
КонецФункции

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма в которой настраивается подключение оборудования.
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	ПодключаемоеОборудованиеРТ.НастроитьПодключаемоеОборудование(Форма);
	
КонецПроцедуры

// Настраивает форму анализа штрихкодов.
//
// Параметры:
//  Форма - УправляемаяФорма - форма анализа штрихкодов.
//
Процедура НастроитьФормуАнализаШтрихкодов(Форма) Экспорт
	
	РаботаСоШтрихкодамиРТ.НастроитьФормуАнализаШтрихкодов(Форма);
	
КонецПроцедуры

#КонецОбласти
