////////////////////////////////////////////////////////////////////////////////
// УчетНДС содержит процедуры и функции для работы 
// с учетом НДС  и обработки действий пользователя для учета НДС.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет список выбора для колонки СтавкаНДС.
//
// Параметры:
//  Элементы 	- ЭлементыФормы - Все элементы переданной формы.
//  Дата 		- Дата - дата на которую необходимо получить актуальную ставку НДС.
//
Процедура ЗаполнитьСписокВыбораСтавокНДС(Элементы, Дата) Экспорт 
	
	Ставка20_18 = СтавкаНДСПоУмолчанию(Дата);
	
	Элементы.ТоварыСтавкаНДС.СписокВыбора.Очистить();
	
	МассивСтавокНДС = Новый Массив;
	МассивСтавокНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
	МассивСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС10);
	МассивСтавокНДС.Добавить(Ставка20_18);
	
	Элементы.ТоварыСтавкаНДС.СписокВыбора.ЗагрузитьЗначения(МассивСтавокНДС);
	
КонецПроцедуры

// Заменяет переданную ставку НДС на актуальную на указанную дату.
//
// Параметры:
//  СтавкаНДС 	- ПеречислениеСсылка.СтавкиНДС - значение ставки НДС, которое необходимо скорректировать
//  Дата 		- Дата - дата на которую необходимо получить актуальную ставку НДС.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС - значение ставки НДС.
//
Функция СкорректироватьСтавкуНДС(СтавкаНДС, Дата) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		
		СтавкаНДС = СтавкаНДСПоУмолчанию(Дата);
			
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции

// Заменяет ставки НДС в табличной части документа на актуальную на дату документа,
// а также пересчитывает соответствующие суммы НДС.
//
// Параметры:
//  Документ - ДокуменОбъект - объект документа, в табличной части которого необходимо заменить ставки НДС
//  ТабличнаяЧасть - ДокументТабличнаяЧасть - табличная часть документа
//
Процедура СкорректироватьНДСВТЧДокумента(Документ, ТабличнаяЧасть) Экспорт
	
	Если Не ЗначениеЗаполнено(ТабличнаяЧасть) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(Документ.Дата), Документ.Дата, ТекущаяДатаСеанса());
	
	Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		СтавкаНДС = СкорректироватьСтавкуНДС(СтрокаТЧ.СтавкаНДС, ДатаАктуальности);
		СтрокаТЧ.СуммаНДС = ОбработкаТабличнойЧастиТоварыКлиентСервер.СуммаНДС(СтрокаТЧ.Сумма, СтавкаНДС, Документ.ЦенаВключаетНДС);
			
	КонецЦикла;
	
КонецПроцедуры

// Возвращает законодательно установленную дату переходного периода при учете НДС.
//
// Возвращаемое значение:
//  Дата - дата переходного периода при учете НДС.
//
Функция ДатаПереходногоПериода() Экспорт
	
	Возврат Дата("20190101");
	
КонецФункции

// Получает признак Применять НДС из регистра ПрименениеСистемНалогообложения по указанным параметрам
//
// Параметры:
//  Дата			 - Дата - дата на которую необходимо определить систему налогообложения. Необязательный.  
//  Организация		 - СправочникСсылка.Организации - организация, для которой необходимо определить систему налогообложения. Обязательный. 
//  Магазин			 - СправочникСсылка.Магазины - магазин, для которого необходимо определить систему налогообложения. Необязательный,
//					   Если заполнен склад, но не заполнен магазин - берется из склада. 
//  Склад			 - СправочникСсылка.Склады - склад, для которого необходимо определить систему налогообложения. Необязательный.
//  ТоварнаяГруппа	 - СправочникСсылка.ТоварныеГруппы - товарная группа номенклатуры, для которой необходимо определить систему налогообложения. Необязательный.  
// 
// Возвращаемое значение:
//  Булево - признак применения НДС.
//
Функция ПрименяетсяНДС(Дата = Неопределено, 
					   Организация, 
					   Магазин 		  = Неопределено, 
					   Склад 		  = Неопределено, 
					   ТоварнаяГруппа = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Склад) И НЕ ЗначениеЗаполнено(Магазин) Тогда
		Магазин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Магазин");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрименениеСистемНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ПрименениеСистемНалогообложенияСрезПоследних.ОсвобожденОтНДС КАК ОсвобожденОтНДС,
	|	ПрименениеСистемНалогообложенияСрезПоследних.Период КАК Период,
	|	ПрименениеСистемНалогообложенияСрезПоследних.Магазин КАК Магазин,
	|	ПрименениеСистемНалогообложенияСрезПоследних.Склад КАК Склад,
	|	ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа
	|ПОМЕСТИТЬ ВТСрезПоследних
	|ИЗ
	|	РегистрСведений.ПрименениеСистемНалогообложения.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И (Магазин = &Магазин
	|					ИЛИ Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка))
	|				И (Склад = &Склад
	|					ИЛИ Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|				И (ТоварнаяГруппа = &ТоварнаяГруппа
	|					ИЛИ ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка))
	|				И ВЫБОР
	|					КОГДА СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ТипыСистемНалогообложенияККТ.Патент)
	|						ТОГДА &Дата >= ДатаНачалаПатента
	|									И &Дата <= ДатаОкончанияПатента
	|								ИЛИ ДатаНачалаПатента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									И ДатаОкончанияПатента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ПрименениеСистемНалогообложенияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТСрезПоследних.Период) КАК Период,
	|	ВТСрезПоследних.Магазин КАК Магазин,
	|	ВТСрезПоследних.Склад КАК Склад,
	|	ВТСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа
	|ПОМЕСТИТЬ ВТПериод
	|ИЗ
	|	ВТСрезПоследних КАК ВТСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСрезПоследних.Магазин,
	|	ВТСрезПоследних.Склад,
	|	ВТСрезПоследних.ТоварнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ВТСрезПоследних.ОсвобожденОтНДС КАК ОсвобожденОтНДС,
	|	ВТСрезПоследних.Магазин КАК Магазин,
	|	ВТСрезПоследних.Склад КАК Склад,
	|	ВТСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа
	|ПОМЕСТИТЬ ВТСистемыНалогообложения
	|ИЗ
	|	ВТСрезПоследних КАК ВТСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериод КАК ВТПериод
	|		ПО ВТСрезПоследних.Период = ВТПериод.Период
	|			И ВТСрезПоследних.Магазин = ВТПериод.Магазин
	|			И ВТСрезПоследних.Склад = ВТПериод.Склад
	|			И ВТСрезПоследних.ТоварнаяГруппа = ВТПериод.ТоварнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПрименениеСистемНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
	|	ПрименениеСистемНалогообложенияСрезПоследних.ОсвобожденОтНДС КАК ОсвобожденОтНДС,
	|	ВЫБОР
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин <> ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа <> ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 1
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин <> ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа <> ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа <> ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин <> ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 4
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин <> ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 5
	|		КОГДА ПрименениеСистемНалогообложенияСрезПоследних.Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				И ПрименениеСистемНалогообложенияСрезПоследних.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТоварныеГруппы.ПустаяСсылка)
	|			ТОГДА 6
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	ВТСистемыНалогообложения КАК ПрименениеСистемНалогообложенияСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Магазин", 		?(ЗначениеЗаполнено(Магазин), Магазин, ПредопределенноеЗначение("Справочник.Магазины.ПустаяСсылка")));
	Запрос.УстановитьПараметр("Склад", 			?(ЗначениеЗаполнено(Склад), Склад, ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка")));
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ?(ЗначениеЗаполнено(ТоварнаяГруппа), ТоварнаяГруппа, ПредопределенноеЗначение("Справочник.ТоварныеГруппы.ПустаяСсылка")));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕСН И Дата < УчетНДС.ДатаПереходногоПериода() Тогда
			Возврат Ложь;
		Иначе
			Возврат НЕ Выборка.ОсвобожденОтНДС;
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Не удалось определить ставку НДС. Настройте применение систем налогообложения для организации ""%1"" на дату %2.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, 
																			  Организация,
																			  Формат(Дата,"ДЛФ=D"));

		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает значение ставки НДС по умолчанию.
//
// Параметры:
//  Дата - Дата - дата на которую необходимо получить ставку НДС по умолчанию,
//               если дата пустая, то будет получена ставка НДС на текущую дату
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС - значение ставки НДС.
//
Функция СтавкаНДСПоУмолчанию(Дата = Неопределено) Экспорт
	
	ДатаПолучения = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Если ДатаПолучения >= ДатаПереходногоПериода() Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	Иначе
		Возврат Перечисления.СтавкиНДС.НДС18;
	КонецЕсли;
	
КонецФункции


#КонецОбласти