///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура заполняет параметры для закрытия смены на ККТ.
//
// Параметры:
//  ПараметрыВыемки - Структура - см. РозничныеПродажиКлиентСервер.ПараметрыВыемкиИзКассы().
//
Процедура ИнициализироватьПараметрыВыемкиИзКассы(ПараметрыВыемки) Экспорт
	
	РозничныеПродажиСервер.ИнициализироватьПараметрыВыемкиИзКассы(ПараметрыВыемки);
	
КонецПроцедуры

// Проверяет является ли вид оплаты безналичной формой оплаты.
//
//Параметры:
//  ВидОплаты - СправочникСсылка.ВидыОплат - вид оплаты.
//
// ВозвращаемоеЗначение:
//  Булево - Истина, если переданный вид оплаты является безналичной формой оплаты.
//
Функция ЭтоОплатаПлатежнойКартой(ВидОплаты) Экспорт
	
	Возврат ОбщегоНазначенияРМКРТ.ЭтоОплатаПлатежнойКартой(ВидОплаты);
	
КонецФункции

// Возвращает вид оплаты платежной картой при продаже
//
// Параметры:
//  ЧекПродажи - ДокументСсылка.ЧекККМ - чек ККМ продажи.
//
// ВозвращаемоеЗначение:
//  ВидОплаты - СправочникСсылка.ВидыОплат - вид оплаты платежной карты, который был учтен при продаже.
//
Функция ВидОплатыПриПродаже(ЧекПродажи) Экспорт
	
	Возврат ОбщегоНазначенияРМКРТ.ВидОплатыПриПродаже(ЧекПродажи);
	
КонецФункции

// Определяет возможность внесения денег.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ.
//  Организация - СправочникСсылка.Организации.
//
// Возвращаемое значение:
//  Булево - Ложь, если документы для внесения отсутствуют.
//
Функция ВозможностьВнесенияДенег(КассаККМ, Организация) Экспорт
	
	Возврат ОбщегоНазначенияРМКРТ.ВозможностьВнесенияДенег(КассаККМ, Организация);
	
КонецФункции

// Проверяет возможность выемки из КассыККМ на требуемую сумму.
//
// Параметры:
//  ПараметрыВыполнения - Структура.
//  ПараметрыИнформации - Структура.
//  ИспользоватьАгентскиеПлатежиИРазделениеВыручки - Булево.
//
// Возвращаемое значение:
//  Булево - Истина, если есть возможность произвести выемку ДС.
//
Функция ВозможностьВыемкиДС(ПараметрыВыполнения, ПараметрыИнформации, ИспользоватьАгентскиеПлатежиИРазделениеВыручки = Ложь) Экспорт
	
	Возврат РозничныеПродажиСервер.ВозможностьОперацииВыемкиДенежныхСредств(
		ПараметрыВыполнения,
		ПараметрыИнформации,
		ИспользоватьАгентскиеПлатежиИРазделениеВыручки);
	
КонецФункции

// Получает цену на товар.
//
//Параметры:
//  Магазин - СправочникСсылка.Магазины - Магазин, для которого нужно получить цену.
//  ДанныеТовара - Структура - структура с параметрами товара, для которых нужно получить цену.
//
// ВозвращаемоеЗначение:
//  Цена - Число - актцальное значения цены.
//
Функция ЦенаПродажи(Магазин, ДанныеТовара) Экспорт
	
	Возврат ОбщегоНазначенияРМКРТ.ЦенаПродажи(Магазин, ДанныеТовара);
	
КонецФункции

// Возвращает значение ФО ИспользоватьНовыйРМК.
// Значение по умолчанию Истина.
//
// ВозвращаемоеЗначение:
//  ИспользоватьНовыйРМК - булево - признак использования нового РМК.
//
Функция ВключеноИспользованиеНовогоРМК() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНовоеРМК");
	
КонецФункции

// Возвращает признак использования автоматических скидок/бонусных программ
// 
// Возвращаемое значение:
//  ИспользоватьАвтоматическиеСкидки - Булево
//
Функция ОпределитьИспользованиеАвтоматическихСкидок() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьАвтоматическиеСкидки = Константы.ИспользоватьАвтоматическиеСкидкиВПродажах.Получить()
									Или Константы.ИспользоватьБонусныеПрограммыЛояльности.Получить();
	Возврат ИспользоватьАвтоматическиеСкидки;
	
КонецФункции

#КонецОбласти

