#Область ПрограммныйИнтерфейс

// Обработчик вызывается при изменении одного из общих параметров.
// В обработчике можно переопределить значения связанных параметров.
// Например, при выборе торгового объекта можно заполнить вид цен.
//
// Параметры:
//   Параметры - см. ИнтеграцияУРМКСлужебный.СтруктураОбщихПараметров
//   ИмяПараметра - Строка - имя изменяемого параметра.
//
Процедура ПриИзмененииОбщихПараметров(Параметры, ИмяПараметра) Экспорт
	
	ИнтеграцияУРМКРТ.ПриИзмененииОбщихПараметров(Параметры, ИмяПараметра);
	
КонецПроцедуры

// Дополняет массив планов обмена XDTO используемых подсистемой обмена БСП.
//
// Параметры:
//  ПланыОбменаXDTO - Массив - массив планов обмена , подлежащий дополнению.
//                    Элементами массива являются объекты метаданных планов обмена
//                    (например Метаданные.ПланыОбмена.ОбменСУРМК).
//
Процедура ПланОбменаУРМК(ПланыОбменаXDTO) Экспорт
	ИнтеграцияУРМКРТ.ПланОбменаУРМК(ПланыОбменаXDTO);
КонецПроцедуры

// Процедура определяет торговый объект используемый в системе по умолчанию..
//
// Параметры:
//  ТорговыйОбъект - Определяемый тип - ОпределяемыйТип.ТорговыйОбъектУРМК.
//
Процедура ТорговыйОбъектУРМКПоУмолчанию(ТорговыйОбъект) Экспорт
	
	ИнтеграцияУРМКРТ.ТорговыйОбъектУРМКПоУмолчанию(ТорговыйОбъект);

КонецПроцедуры

// Устанавливает параметры выбора КассККМ.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, в которой нужно установить параметры выбора.
//  ИмяПоляВвода - Строка - Имя поля ввода номенклатуры.
//
Процедура УстановитьПараметрыВыбораКассыККМ(Форма, ИмяПоляВвода) Экспорт
	
	ИнтеграцияУРМКРТ.УстановитьПараметрыВыбораКассыККМ(Форма, ИмяПоляВвода);
	
КонецПроцедуры

// Устанавливает параметры выбора торгового объекта.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, в которой нужно установить параметры выбора.
//  ИмяПоляВвода - Строка - Имя поля ввода номенклатуры.
//
Процедура УстановитьПараметрыВыбораТорговыйОбъект(Форма, ИмяПоляВвода) Экспорт
	
	ИнтеграцияУРМКРТ.УстановитьПараметрыВыбораТорговыйОбъект(Форма, ИмяПоляВвода);
	
КонецПроцедуры

// Устанавливает отбор в динамическом списке.
//
// Параметры:
//  Список - ДинамическийСписок - список, для которого требуется установить отбор.
//
Процедура УстановитьОтборПоТипуКассыККМ(Список) Экспорт
	
	ИнтеграцияУРМКРТ.УстановитьОтборПоТипуКассыККМ(Список);
	
КонецПроцедуры

// Устанавливает разрешение на использование в подсистеме расширенного режима настройки обмена с 1С:РМК.
//
// Возвращаемое значение:
//  Булево - Истина, если разрешен расширенный режим настройки обмена, Ложь - в противном случае.
//
Функция РазрешенРасширенныйРежимНастройкиОбменаУРМК() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Устанавливает ПараметрыФормы, используемые для открытия подчиненной формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, в которой нужно определить ПараметрыФормы для открытия подчиненной формы.
//
// Возвращаемое значение:
//  Структура - структура параметров, которые будут переданы в метод ОткрытьФорму.
//
Функция ПараметрыЗаполненияПередНачаломДобавленияУРМК(Форма, СтруктураПараметров) Экспорт
	
	Возврат ИнтеграцияУРМКРТ.ПараметрыЗаполненияПередНачаломДобавленияУРМК(Форма, СтруктураПараметров);
	
КонецФункции

// Устанавливает переопределяемые отборы для запроса,
// см. ПомощникНастройкиОбменаУРМК.ПодготовитьДанныеНастроекОбмена.
//
// Возвращаемое значение:
//  Текст - Переопределяемая часть текста запроса.
//
Функция ОтборыТекстаЗапросовПодготовитьДанныеНастроекОбмена() Экспорт
	
	Возврат ИнтеграцияУРМКРТ.ОтборыТекстаЗапросовПодготовитьДанныеНастроекОбмена();
	
КонецФункции

#КонецОбласти
