
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец",ВладелецХарактеристик(ПараметрКоманды));
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ВладелецХарактеристик(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		
		Возврат ПараметрКоманды;
	Иначе // Это номенклатура
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		
		Если ИспользованиеХарактеристик = Перечисления.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ИндивидуальныеДляНоменклатуры Тогда
			Возврат ПараметрКоманды;
		Иначе
			Возврат ВидНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции