
#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыДокументаОплаты(ЧекККМПродажа) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиРТСервер.ПолучитьПараметрыДокументаОплаты(ЧекККМПродажа);
	
КонецФункции

Функция ТорговыеТочкиОперации(ДокументОперации) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемами.ТорговыеТочкиОперации(ДокументОперации);
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиТорговойТочки(Интеграция) Экспорт
	
	НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемами.НастройкиТорговойТочки(Интеграция);
	
	Попытка
		
		Если НастройкиИнтеграции.ВыборПлатежнойСистемыВозврата Тогда
			НастройкиИнтеграции.Вставить("ПлатежныеСистемыВозврата", ИнтеграцияСПлатежнымиСистемами.ПлатежныеСистемыВозврата(Интеграция));
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат НастройкиИнтеграции;
	
КонецФункции

Функция СформироватьДанныеQRКода(Интеграция, Идентификатор, УникальныйИдентификатор) Экспорт 
	
	ДвоичныеДанныеQRКода	= ИнтеграцияСПлатежнымиСистемами.СоздатьQRКодОплаты(
								Интеграция,
								Идентификатор,
								280,
								0);
	
	СтруктураКода = Новый Структура;
	СтруктураКода.Вставить("ИдентификаторQRКода", 	Идентификатор);
	СтруктураКода.Вставить("КартинкаQRКода",		Base64Строка(ДвоичныеДанныеQRКода));
	СтруктураКода.Вставить("ДанныеQRКода",			ПоместитьВоВременноеХранилище(ДвоичныеДанныеQRКода, УникальныйИдентификатор));
	
	Возврат СтруктураКода;

КонецФункции

Функция ИдентификаторыОперацииОплаты(Интеграция, ДокументОплаты) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиРТСервер.ИдентификаторыОперацииОплаты(Интеграция, ДокументОплаты);
	
КонецФункции

Функция ПолучитьИдентификаторОплаты(ЗаявкаНаОплату, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование идентификатора оплаты.'");
	
	Если ЗаявкаНаОплату.Свойство("ДокументОплаты")
		И Не ЗначениеЗаполнено(ЗаявкаНаОплату.ДокументОплаты) Тогда
		ЗаявкаНаОплату.ДокументОплаты = ИнтеграцияСПлатежнымиСистемамиРТСервер.ПолучитьСсылкуНовогоЧекаККМ().ЧекККМВОбработке;
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРТСервер.ИдентификаторОплатыВПлатежнойСистеме",
		ЗаявкаНаОплату,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции
	
Функция ОпределитьСтатусОплатыОплаты(ДокументОплаты, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументОплаты", 	ДокументОплаты);
	ПараметрыПроцедуры.Вставить("Интеграция", 		Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса оплаты.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРТСервер.СтатусОплатыВПлатежнойСистеме",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВозвратОплаты(ЗаявкаНаВозврат, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Возврат оплаты в платежной системе.'");
	
	Если ЗаявкаНаВозврат.Свойство("ДокументВозврата")
		И Не ЗначениеЗаполнено(ЗаявкаНаВозврат.ДокументВозврата) Тогда
		ЗаявкаНаВозврат.ДокументВозврата = ИнтеграцияСПлатежнымиСистемамиРТСервер.ПолучитьСсылкуНовогоЧекаККМ().ЧекККМВОбработке;
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРТСервер.ВозвратОплаты",
		ЗаявкаНаВозврат,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПодтвердитьВозврат(ДокументВозврата, Интеграция) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиРТСервер.ПодтвердитьВозврат(ДокументВозврата, Интеграция);
	
КонецФункции

Функция ОпределитьСтатусВозврата(ДокументВозврата, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументВозврата", ДокументВозврата);
	ПараметрыПроцедуры.Вставить("Интеграция",  		Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса возврата.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСПлатежнымиСистемамиРТСервер.СтатусВозвратОплаты",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ОтменаОплаты(ДокументОплаты, Интеграция, ИдентификаторЗаданияФормированияQRКода, ИдентификаторЗаданияПроверкиСтатуса, ИдентификаторЗаданияВозврата) Экспорт
	
	НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемами.НастройкиТорговойТочки(Интеграция);
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияФормированияQRКода) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияФормированияQRКода);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияВозврата) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияВозврата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияПроверкиСтатуса) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияПроверкиСтатуса);
	КонецЕсли;
	
	// Перед отменой нужно определить статус оплаты.
	РезультатОперации = ИнтеграцияСПлатежнымиСистемами.СтатусОплаты(ДокументОплаты, Интеграция, Ложь);
	
	// В зависимости от статуса оплаты выполняется соответствующая операция.
	Если РезультатОперации.СтатусОперации = ИнтеграцияСПлатежнымиСистемамиКлиентСервер.СтатусОперацииВыполняется() 
		И НастройкиИнтеграции.ОтменаЗаказа Тогда
		
		Результат = ИнтеграцияСПлатежнымиСистемами.ОтменитьЗаказНаОплату(
			ДокументОплаты,
			Интеграция);
			
	ИначеЕсли РезультатОперации.СтатусОперации = ИнтеграцияСПлатежнымиСистемамиКлиентСервер.СтатусОперацииВыполнена() 
			И НастройкиИнтеграции.ОтменаОплаты Тогда
			
		Результат = ИнтеграцияСПлатежнымиСистемами.ОтменитьОплату(
			ДокументОплаты,
			Интеграция);
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
