////////////////////////////////////////////////////////////////////////////////
// ПодключаемоеОборудованиеРТВызовСервера содержит процедуры и функции 
// для работы с подключаемым оборудованием.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПроцедурыПоискаИОпределенияТиповШтрихкодов

// Подготовка данных для выбора.
//
// Параметры:
//  СтруктураРезультат - Структура - структура данных для выбора.
//
Процедура ПодготовитьДанныеДляВыбора(СтруктураРезультат) Экспорт
	
	ПодключаемоеОборудованиеРТ.ПодготовитьДанныеДляВыбора(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработкиРаспределенияВыручкиПоСекциямФР

// Записывает признак пробития чека в документ.
//
// Параметры:
//  ДокументыНаККМ - ДокументСсылка - документ для пробития.
//  НомерЧекаККМ - Число - номер чека ККМ.
//
// Возвращаемое значение:
//  Булево - признак выполнения операции.
//
Функция ПровестиПробитыйДокумент(ДокументНаККМ, НомерЧекаККМ) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.ПровестиПробитыйДокумент(ДокументНаККМ, НомерЧекаККМ);
	
КонецФункции
// Подготавливает данные для печати чека на ФР.
// 
// Параметры:
//  ДокументыНаККМ - ДокументСсылка - документ для пробития.
//  РаспределениеВыручкиПоСекциям - 
//  НомерЧекаККМ - Число - номер чека ККМ.
//
Функция ВходящиеДанныеДляФР(ДокументНаККМ, РаспределениеВыручкиПоСекциям, НомерЧека) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.ВходящиеДанныеДляФР(ДокументНаККМ, РаспределениеВыручкиПоСекциям, НомерЧека);;
	
КонецФункции

// Возвращает значение реквизита документа "СуммаДокумента".
//
// Параметры:
//  ДокументНаККМ - ДокументСсылка - документ по которому необходимо получить сумму.
//
// Возвращаемое значение:
//  Число - сумма документа.
// 
Функция СуммаДокумента(ДокументНаККМ) Экспорт
	
	Возврат ДокументНаККМ.СуммаДокумента;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыПоискаИОпределенияПоМагнитномуКоду

// Возвращает список кодов карты, полученный из данных
// карты с применением форматов записи кодов магнитных карт.
// 
// Параметры:
//  ДанныеКарты - Строка - данные магнитной карты.
//
// Возвращаемое значение:
//  СписокЗначений - таблица кодов карты.
//
Функция ПолучитьКодыКарты(ДанныеКарты) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.ПолучитьКодыКарты(ДанныеКарты);
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедурыОбработкиСобытийПоискаПоШКМКИРаботыСТСД

// Сформировать массив товаров по массиву штрихкодов.
// 
// Параметры:
//  ДанныеШтрихкодов - Массив - данные штрихкодов.
//  ОбновитьКоличество - Булево - признак необходимости обновления количества.
//
// Возвращаемое значение:
//  Структура - структруа сформированных товаров.
//
Функция СформироватьМассивТоваров(ДанныеШтрихкодов, ОбновитьКоличество) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.СформироватьМассивТоваров(ДанныеШтрихкодов, ОбновитьКоличество);
	
КонецФункции

// Обрабатывает данные по номенклатуре из ТСД
//
// Параметры:
//  СтруктураПараметров - Структура - структура параметров свертки данных.
//
// Возвращаемое значение:
//  Массив - массив свернутых данных по номенклатуре.
// 
Функция СвернутьДанныеПоНоменклатуреИзТСДСервер(СтруктураПараметров) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.СвернутьДанныеПоНоменклатуреИзТСДСервер(СтруктураПараметров);
	
КонецФункции

Функция МаркируемаяПродукция(Штрихкод) Экспорт
	
	Возврат ПодключаемоеОборудованиеРТ.МаркируемаяПродукция(Штрихкод);
	
КонецФункции

#КонецОбласти

Процедура ДанныеПоШтрихкоду(Штрихкод, МассивТоваровДляПечати) Экспорт
	
	ПодключаемоеОборудованиеРТ.ДанныеПоШтрихкоду(Штрихкод, МассивТоваровДляПечати);
	
КонецПроцедуры

// Переопределяет печать слип чека эквайринговой операции. 
//  ПечатьСлипЧека - Булево - Определяет будет ли распечатан слип-чек, по умолчанию Истина.  
//  ПолныйСлипЧек  - Булево - Определяет какой слип-чек будет распечатан полный или короткий, по умолчанию Истина. 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки.
//
Процедура ПечатьСлипЧекаЭквайринговойОперации(ПечатьСлипЧека, ПолныйСлипЧек, СтандартнаяОбработка) Экспорт
	
	ПодключаемоеОборудованиеРТ.ПечатьСлипЧекаЭквайринговойОперации(ПечатьСлипЧека, ПолныйСлипЧек, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
