////////////////////////////////////////////////////////////////////////////////
// ОбщегоНазначенияРТПовтИсп содержит процедуры и функции 
// общего назначения для работы с конфигурацией.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает значения констант контролируемых в базовой версии.
//
// Возвращаемое значение:
//  Структура - структура возвращаемых констант.
//
Функция ЗначенияКонстантКонтролируемыхВБазовойВерсии() Экспорт 
	
	Результат = Новый Структура;
	
	Возврат Результат;
	
КонецФункции

// Возвращает контрагента розничного покупателя
// ВозвращаемоеЗначение:
//  СправочникСсылка.Контрагенты - контрагент Розничный покупатель.
Функция РозничныйПокупатель() Экспорт
	
	Возврат Константы.КонтрагентРозничныйПокупатель.Получить();
	
КонецФункции

// Возвращает признак учета НДС хотя бы по одной из организаций
// ВозвращаемоеЗначение:
//  Булево - Применяется учет НДС.
Функция ПрименяетсяНДС() Экспорт
	
	ПрименяетсяНДС = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ВыборкаОрганизаций = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОрганизаций.Следующий() Цикл
		ПрименяетсяНДС = Макс(ПрименяетсяНДС, УчетНДС.ПрименяетсяНДС(,ВыборкаОрганизаций.Ссылка));
	КонецЦикла;
	
	Возврат ПрименяетсяНДС;
	
КонецФункции

#КонецОбласти