#Область ПрограммныйИнтерфейс

Функция ДоступенВводНомераТелефонаИлиАдресаЭП(Форма) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ДанныеSMSИлиEmail");
	
КонецФункции

Функция ТелефонКорректен(Знач Телефон, ПодготовитьТелефон = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Возврат Ложь
	КонецЕсли;
	
	Если ПодготовитьТелефон Тогда
		
		ДанныеТелефона = ПодготовитьДанныеТелефона(Телефон);
		
		Если НЕ ДанныеТелефона.ЭтоТелефон Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Телефон = ДанныеТелефона.Телефон;
		
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(Телефон);
	
	Если НЕ ДлинаСтроки = 10 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаСимволовЦифр = "1234567890";
	Для Индекс = 1 По 10 Цикл
		Символ = Сред(Телефон, Индекс, 1);
		Если Найти(СтрокаСимволовЦифр, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЕмаилКорректен(Емаил) Экспорт
	
	Если Не ЗначениеЗаполнено(Емаил) Тогда
		Возврат Ложь
	КонецЕсли;
	
	Отказ = Ложь;
	Если ЗначениеЗаполнено(Емаил) Тогда
		НомерСимволаПочты = Найти(Емаил, "@");
		Отказ = НомерСимволаПочты < 2 ИЛИ СтрДлина(Емаил) = 2;
		Если НЕ Отказ Тогда
			ОстатокEmail = Сред(Емаил, НомерСимволаПочты + 1);
			НомерСимволаТочки = Найти(ОстатокEmail, ".");
			Отказ = НомерСимволаТочки < 2 ИЛИ СтрДлина(ОстатокEmail) = 2;
			Если НЕ Отказ Тогда
				ОстатокEmail = Сред(ОстатокEmail, НомерСимволаТочки + 1);
				Отказ = НЕ ЗначениеЗаполнено(ОстатокEmail);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

Функция ПодготовитьТелефон(Знач Телефон) Экспорт
	
	ДанныеТелефона = ПодготовитьДанныеТелефона(Телефон);
	
	Возврат ДанныеТелефона.Телефон;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПодготовитьДанныеТелефона(Знач Телефон)
	
	Телефон = СтрЗаменить(Телефон, "(", "");
	Телефон = СтрЗаменить(Телефон, ")", "");
	Телефон = СтрЗаменить(Телефон, "-", "");
	Телефон = СтрЗаменить(Телефон, " ", "");
	
	ДлинаСтроки = СтрДлина(Телефон);
	ЭтоТелефон	= Ложь;
	
	Если ДлинаСтроки = 11 И Лев(Телефон, 1) = "8" Тогда
		Телефон 	= Сред(Телефон, 2);
		ЭтоТелефон	= Истина;
	ИначеЕсли ДлинаСтроки = 11 И Лев(Телефон, 1) = "7" Тогда
		Телефон 	= Сред(Телефон, 2);
		ЭтоТелефон	= Истина;
	ИначеЕсли ДлинаСтроки = 12 И Лев(Телефон, 2) = "+7" Тогда
		Телефон 	= Сред(Телефон, 3);
		ЭтоТелефон	= Истина;
	КонецЕсли;
	
	Возврат Новый Структура("Телефон, ЭтоТелефон", Телефон, ЭтоТелефон);
	
КонецФункции

#КонецОбласти

