
Функция Exchange(Data)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаНаОбъект = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("API_Exchange", Истина);
	
	ИмяОбработки = ВнешниеОбработки.Подключить(ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "ХранилищеОбработки"),, Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
	
	Попытка
		data = Обработка.ВыполнитьОбмен(data);
		Возврат data;
	Исключение
		ЗаписьЖурналаРегистрации("#API_Обмен", УровеньЖурналаРегистрации.Ошибка, ,, ОписаниеОшибки());
		// надо передавать ошибку обмена.
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции

