////////////////////////////////////////////////////////////////////////////////
// Модуль "УправлениеПользователямиВызовСервера", содержит процедуры и функции для 
// управления пользователями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает булево значение права текущего пользователя.
//
// Параметры:
//  Право - ПланВидовХарактеристикСсылка.ПраваПользователей - право пользователя.
//  ЗначениеПоУмолчанию - Булево - признак использования значения по умолчанию.
//  Пользователь - СправочникСсылка.Пользователи - пользователь для которого необходимо получить права.
//
// Возвращаемое значение:
//  Булево - право пользователя.
//
Функция ПолучитьБулевоЗначениеПраваПользователя(Право, ЗначениеПоУмолчанию = Ложь, Пользователь = Неопределено) Экспорт
	
	Возврат УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(Право, ЗначениеПоУмолчанию, Пользователь);
	
КонецФункции // ПолучитьБулевоЗначениеПраваПользователя()

#КонецОбласти